[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:23:81
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
   access: EntitlementAccess,
-): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {
-  const port = buildAppDeps().orgEntitlements;
-  const snapshot = await resolveOrgEntitlementSnapshot(port, ctx.organizationId);
-  if (!snapshot.entitlements[mechanic]) {
-    return { ok: false, reason: 'entitlement_required' };
-  }
-  if (access === 'read') return { ok: true };
-
-  if (snapshot.access.lifecycle === 'read_only') {
-    return { ok: false, reason: 'commercial_read_only' };
-  }
-  if (snapshot.access.lifecycle === 'blocked') {
-    return { ok: false, reason: 'commercial_blocked' };
-  }
-  return { ok: true };
-}
+): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {}
 
 /**
killedBy: requireEntitlementForRead uses the supplied trusted context and has no auth side effect
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:26:7
 ): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {
   const port = buildAppDeps().orgEntitlements;
   const snapshot = await resolveOrgEntitlementSnapshot(port, ctx.organizationId);
-  if (!snapshot.entitlements[mechanic]) {
+  if (false) {
     return { ok: false, reason: 'entitlement_required' };
   }
killedBy: requireEntitlementForRead returns 403 entitlement_required when mechanic is disabled by an override
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:26:7
 ): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {
   const port = buildAppDeps().orgEntitlements;
   const snapshot = await resolveOrgEntitlementSnapshot(port, ctx.organizationId);
-  if (!snapshot.entitlements[mechanic]) {
+  if (true) {
     return { ok: false, reason: 'entitlement_required' };
   }
killedBy: requireEntitlementForRead uses the supplied trusted context and has no auth side effect
statusReason: expected { ok: false, …(1) } to deeply equal { ok: true }

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:27:18
   const port = buildAppDeps().orgEntitlements;
   const snapshot = await resolveOrgEntitlementSnapshot(port, ctx.organizationId);
   if (!snapshot.entitlements[mechanic]) {
-    return { ok: false, reason: 'entitlement_required' };
+    return { ok: true, reason: 'entitlement_required' };
   }
   if (access === 'read') return { ok: true };

[Survived] ObjectLiteral
src/app-layer/guards/requireEntitlement.ts:27:12
   const port = buildAppDeps().orgEntitlements;
   const snapshot = await resolveOrgEntitlementSnapshot(port, ctx.organizationId);
   if (!snapshot.entitlements[mechanic]) {
-    return { ok: false, reason: 'entitlement_required' };
+    return {};
   }
   if (access === 'read') return { ok: true };

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:29:7
   if (!snapshot.entitlements[mechanic]) {
     return { ok: false, reason: 'entitlement_required' };
   }
-  if (access === 'read') return { ok: true };
+  if (true) return { ok: true };
 
   if (snapshot.access.lifecycle === 'read_only') {

[Survived] EqualityOperator
src/app-layer/guards/requireEntitlement.ts:29:7
   if (!snapshot.entitlements[mechanic]) {
     return { ok: false, reason: 'entitlement_required' };
   }
-  if (access === 'read') return { ok: true };
+  if (access !== 'read') return { ok: true };
 
   if (snapshot.access.lifecycle === 'read_only') {

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:31:50
   }
   if (access === 'read') return { ok: true };
 
-  if (snapshot.access.lifecycle === 'read_only') {
-    return { ok: false, reason: 'commercial_read_only' };
-  }
+  if (snapshot.access.lifecycle === 'read_only') {}
   if (snapshot.access.lifecycle === 'blocked') {
     return { ok: false, reason: 'commercial_blocked' };

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:31:7
   }
   if (access === 'read') return { ok: true };
 
-  if (snapshot.access.lifecycle === 'read_only') {
+  if (false) {
     return { ok: false, reason: 'commercial_read_only' };
   }

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:32:18
   if (access === 'read') return { ok: true };
 
   if (snapshot.access.lifecycle === 'read_only') {
-    return { ok: false, reason: 'commercial_read_only' };
+    return { ok: true, reason: 'commercial_read_only' };
   }
   if (snapshot.access.lifecycle === 'blocked') {

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:34:48
   if (snapshot.access.lifecycle === 'read_only') {
     return { ok: false, reason: 'commercial_read_only' };
   }
-  if (snapshot.access.lifecycle === 'blocked') {
-    return { ok: false, reason: 'commercial_blocked' };
-  }
+  if (snapshot.access.lifecycle === 'blocked') {}
   return { ok: true };
 }

[Survived] EqualityOperator
src/app-layer/guards/requireEntitlement.ts:34:7
   if (snapshot.access.lifecycle === 'read_only') {
     return { ok: false, reason: 'commercial_read_only' };
   }
-  if (snapshot.access.lifecycle === 'blocked') {
+  if (snapshot.access.lifecycle !== 'blocked') {
     return { ok: false, reason: 'commercial_blocked' };
   }

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:35:18
     return { ok: false, reason: 'commercial_read_only' };
   }
   if (snapshot.access.lifecycle === 'blocked') {
-    return { ok: false, reason: 'commercial_blocked' };
+    return { ok: true, reason: 'commercial_blocked' };
   }
   return { ok: true };

[Survived] StringLiteral
src/app-layer/guards/requireEntitlement.ts:35:33
     return { ok: false, reason: 'commercial_read_only' };
   }
   if (snapshot.access.lifecycle === 'blocked') {
-    return { ok: false, reason: 'commercial_blocked' };
+    return { ok: false, reason: "" };
   }
   return { ok: true };

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:37:16
   if (snapshot.access.lifecycle === 'blocked') {
     return { ok: false, reason: 'commercial_blocked' };
   }
-  return { ok: true };
+  return { ok: false };
 }
 

[NoCoverage] BlockStatement
src/app-layer/guards/requireEntitlement.ts:47:21
 export async function assertMechanicEnabled(
   organizationId: string,
   mechanic: OrgMechanic,
-): Promise<boolean> {
-  return isMechanicEnabled(buildAppDeps().orgEntitlements, organizationId, mechanic);
-}
+): Promise<boolean> {}
 
 /** Read-only API adapter. Lifecycle recovery reads remain available. */

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:57:7
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
-  if (!decision.ok) {
+  if (true) {
     return {
       ok: false,

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:72:7
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  if (!decision.ok) {
+  if (decision.ok) {
     return {
       ok: false,

[Survived] ObjectLiteral
src/app-layer/guards/requireEntitlement.ts:89:35
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
 > {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
-  return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
+  return decision.ok ? decision : {};
 }
 

[Survived] StringLiteral
src/app-layer/guards/requireEntitlement.ts:99:58
 ): Promise<
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
 > {
-  const decision = await checkEntitlement(ctx, mechanic, 'mutation');
+  const decision = await checkEntitlement(ctx, mechanic, "");
   return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
 }

[NoCoverage] BlockStatement
src/app-layer/guards/requireEntitlement.ts:111:18
 export async function requireEntitlementForPage(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<void> {
-  if (!(await assertMechanicEnabled(ctx.organizationId, mechanic))) {
-    notFound();
-  }
-}
+): Promise<void> {}
 

[NoCoverage] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:112:7
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
 ): Promise<void> {
-  if (!(await assertMechanicEnabled(ctx.organizationId, mechanic))) {
+  if (false) {
     notFound();
   }

[NoCoverage] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:112:7
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
 ): Promise<void> {
-  if (!(await assertMechanicEnabled(ctx.organizationId, mechanic))) {
+  if (await assertMechanicEnabled(ctx.organizationId, mechanic)) {
     notFound();
   }
