[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:33:6
 function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
   if (
-    (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
+    (mechanicClass === 'объём' || quota.unit !== 'bytes') ||
     (mechanicClass === 'запас' && quota.unit !== 'items') ||
     (mechanicClass !== 'объём' && mechanicClass !== 'запас')

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:33:6
 function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
   if (
-    (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
+    (true && quota.unit !== 'bytes') ||
     (mechanicClass === 'запас' && quota.unit !== 'items') ||
     (mechanicClass !== 'объём' && mechanicClass !== 'запас')

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:34:6
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
   if (
     (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
-    (mechanicClass === 'запас' && quota.unit !== 'items') ||
+    (mechanicClass !== 'запас' && quota.unit !== 'items') ||
     (mechanicClass !== 'объём' && mechanicClass !== 'запас')
   ) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:34:35
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
   if (
     (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
-    (mechanicClass === 'запас' && quota.unit !== 'items') ||
+    (mechanicClass === 'запас' && true) ||
     (mechanicClass !== 'объём' && mechanicClass !== 'запас')
   ) {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:35:6
   if (
     (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
     (mechanicClass === 'запас' && quota.unit !== 'items') ||
-    (mechanicClass !== 'объём' && mechanicClass !== 'запас')
+    (mechanicClass === 'объём' && mechanicClass !== 'запас')
   ) {
     throw new Error('tariff_quota_unit_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:35:6
   if (
     (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
     (mechanicClass === 'запас' && quota.unit !== 'items') ||
-    (mechanicClass !== 'объём' && mechanicClass !== 'запас')
+    (false)
   ) {
     throw new Error('tariff_quota_unit_invalid');

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:36:5
     (mechanicClass === 'объём' && quota.unit !== 'bytes') ||
     (mechanicClass === 'запас' && quota.unit !== 'items') ||
     (mechanicClass !== 'объём' && mechanicClass !== 'запас')
-  ) {
-    throw new Error('tariff_quota_unit_invalid');
-  }
+  ) {}
   // §5a item 2.6a (owner 31.07): the threshold exists only where he asked for it — patients and
   // file volume. Branches get no warning at all, so a stored percent there is a refusal, not a

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:42:28
   // §5a item 2.6a (owner 31.07): the threshold exists only where he asked for it — patients and
   // file volume. Branches get no warning at all, so a stored percent there is a refusal, not a
   // value quietly dropped on read.
-  const warningAtPercent = quota.warningAtPercent ?? null;
+  const warningAtPercent = quota.warningAtPercent && null;
   if (warningAtPercent !== null && !quotaMechanicSupportsWarning(mechanic)) {
     throw new Error('tariff_quota_warning_unsupported');

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:43:7
   // file volume. Branches get no warning at all, so a stored percent there is a refusal, not a
   // value quietly dropped on read.
   const warningAtPercent = quota.warningAtPercent ?? null;
-  if (warningAtPercent !== null && !quotaMechanicSupportsWarning(mechanic)) {
+  if (warningAtPercent !== null || !quotaMechanicSupportsWarning(mechanic)) {
     throw new Error('tariff_quota_warning_unsupported');
   }

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:43:36
   // file volume. Branches get no warning at all, so a stored percent there is a refusal, not a
   // value quietly dropped on read.
   const warningAtPercent = quota.warningAtPercent ?? null;
-  if (warningAtPercent !== null && !quotaMechanicSupportsWarning(mechanic)) {
+  if (warningAtPercent !== null && quotaMechanicSupportsWarning(mechanic)) {
     throw new Error('tariff_quota_warning_unsupported');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:47:5
     throw new Error('tariff_quota_warning_unsupported');
   }
   if (
-    warningAtPercent !== null &&
-    (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
+    true
   ) {
     throw new Error('tariff_quota_warning_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:47:5
     throw new Error('tariff_quota_warning_unsupported');
   }
   if (
-    warningAtPercent !== null &&
+    true &&
     (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
   ) {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:48:49
   }
   if (
     warningAtPercent !== null &&
-    (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
+    (!Number.isSafeInteger(warningAtPercent) || warningAtPercent <= 0 || warningAtPercent > 100)
   ) {
     throw new Error('tariff_quota_warning_invalid');

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:48:6
   }
   if (
     warningAtPercent !== null &&
-    (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
+    (Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
   ) {
     throw new Error('tariff_quota_warning_invalid');

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:49:5
   if (
     warningAtPercent !== null &&
     (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
-  ) {
-    throw new Error('tariff_quota_warning_invalid');
-  }
+  ) {}
   if (quota.kind === 'unlimited') {
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:50:21
     warningAtPercent !== null &&
     (!Number.isSafeInteger(warningAtPercent) || warningAtPercent < 0 || warningAtPercent > 100)
   ) {
-    throw new Error('tariff_quota_warning_invalid');
+    throw new Error("");
   }
   if (quota.kind === 'unlimited') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:52:7
   ) {
     throw new Error('tariff_quota_warning_invalid');
   }
-  if (quota.kind === 'unlimited') {
+  if (true) {
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:52:7
   ) {
     throw new Error('tariff_quota_warning_invalid');
   }
-  if (quota.kind === 'unlimited') {
+  if (false) {
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:56:45
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }
-  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
+  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) >= 0) {
     throw new Error('tariff_quota_limit_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:56:7
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }
-  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
+  if (false) {
     throw new Error('tariff_quota_limit_invalid');
   }

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:57:21
     return;
   }
   if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
-    throw new Error('tariff_quota_limit_invalid');
+    throw new Error("");
   }
 }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:61:68
   }
 }
 
-function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
-  const normalized: TariffQuotaMap = {};
-  for (const [key, value] of Object.entries(quotas)) {
-    assertMechanic(key);
-    if (!value) throw new Error('tariff_quota_mechanic_invalid');
-    assertQuota(key, value);
-    if (key === 'files' && value.unit === 'bytes') {
-      normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'patient_count' && value.unit === 'items') {
-      normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'branches' && value.unit === 'items') {
-      // `assertQuota` already refused a threshold here; drop the key rather than persist it.
-      normalized.branches = { kind: value.kind, limit: value.limit, unit: 'items' };
-    } else throw new Error('tariff_quota_mechanic_invalid');
-  }
-  return normalized;
-}
+function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {}
 
 /**

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:63:54
 
 function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
   const normalized: TariffQuotaMap = {};
-  for (const [key, value] of Object.entries(quotas)) {
-    assertMechanic(key);
-    if (!value) throw new Error('tariff_quota_mechanic_invalid');
-    assertQuota(key, value);
-    if (key === 'files' && value.unit === 'bytes') {
-      normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'patient_count' && value.unit === 'items') {
-      normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'branches' && value.unit === 'items') {
-      // `assertQuota` already refused a threshold here; drop the key rather than persist it.
-      normalized.branches = { kind: value.kind, limit: value.limit, unit: 'items' };
-    } else throw new Error('tariff_quota_mechanic_invalid');
-  }
+  for (const [key, value] of Object.entries(quotas)) {}
   return normalized;
 }

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:65:9
   const normalized: TariffQuotaMap = {};
   for (const [key, value] of Object.entries(quotas)) {
     assertMechanic(key);
-    if (!value) throw new Error('tariff_quota_mechanic_invalid');
+    if (value) throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key, value);
     if (key === 'files' && value.unit === 'bytes') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:65:9
   const normalized: TariffQuotaMap = {};
   for (const [key, value] of Object.entries(quotas)) {
     assertMechanic(key);
-    if (!value) throw new Error('tariff_quota_mechanic_invalid');
+    if (true) throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key, value);
     if (key === 'files' && value.unit === 'bytes') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:67:9
     assertMechanic(key);
     if (!value) throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key, value);
-    if (key === 'files' && value.unit === 'bytes') {
+    if (false) {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:67:28
     assertMechanic(key);
     if (!value) throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key, value);
-    if (key === 'files' && value.unit === 'bytes') {
+    if (key === 'files' && value.unit !== 'bytes') {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:68:56
     if (!value) throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key, value);
     if (key === 'files' && value.unit === 'bytes') {
-      normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
+      normalized.files = { ...value, warningAtPercent: value.warningAtPercent && null };
     } else if (key === 'patient_count' && value.unit === 'items') {
       normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:69:16
     assertQuota(key, value);
     if (key === 'files' && value.unit === 'bytes') {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'patient_count' && value.unit === 'items') {
+    } else if (key === 'patient_count' || value.unit === 'items') {
       normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'branches' && value.unit === 'items') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:69:16
     assertQuota(key, value);
     if (key === 'files' && value.unit === 'bytes') {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'patient_count' && value.unit === 'items') {
+    } else if (false) {
       normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'branches' && value.unit === 'items') {

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:70:64
     if (key === 'files' && value.unit === 'bytes') {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {
-      normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
+      normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent && null };
     } else if (key === 'branches' && value.unit === 'items') {
       // `assertQuota` already refused a threshold here; drop the key rather than persist it.

[Survived] ObjectLiteral
src/modules/org-entitlements/service.ts:70:34
     if (key === 'files' && value.unit === 'bytes') {
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {
-      normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
+      normalized.patient_count = {};
     } else if (key === 'branches' && value.unit === 'items') {
       // `assertQuota` already refused a threshold here; drop the key rather than persist it.

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:71:62
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {
       normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'branches' && value.unit === 'items') {
-      // `assertQuota` already refused a threshold here; drop the key rather than persist it.
-      normalized.branches = { kind: value.kind, limit: value.limit, unit: 'items' };
-    } else throw new Error('tariff_quota_mechanic_invalid');
+    } else if (key === 'branches' && value.unit === 'items') {} else throw new Error('tariff_quota_mechanic_invalid');
   }
   return normalized;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:71:16
       normalized.files = { ...value, warningAtPercent: value.warningAtPercent ?? null };
     } else if (key === 'patient_count' && value.unit === 'items') {
       normalized.patient_count = { ...value, warningAtPercent: value.warningAtPercent ?? null };
-    } else if (key === 'branches' && value.unit === 'items') {
+    } else if (false) {
       // `assertQuota` already refused a threshold here; drop the key rather than persist it.
       normalized.branches = { kind: value.kind, limit: value.limit, unit: 'items' };

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:74:28
     } else if (key === 'branches' && value.unit === 'items') {
       // `assertQuota` already refused a threshold here; drop the key rather than persist it.
       normalized.branches = { kind: value.kind, limit: value.limit, unit: 'items' };
-    } else throw new Error('tariff_quota_mechanic_invalid');
+    } else throw new Error("");
   }
   return normalized;

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:84:71
  * bounded («число строк задаёт владелец, ограничений нет»), the offset may point before or after
  * the end of the period, and the text is never inspected: it is the owner's, variables included.
  */
-function assertAccessNotification(rule: AccessNotificationRule): void {
-  if (!Number.isSafeInteger(rule.offsetDays)) {
-    throw new Error('access_notification_offset_invalid');
-  }
-  const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
-  if (!conditions.includes(rule.condition)) {
-    throw new Error('access_notification_condition_invalid');
-  }
-  if (!rule.template.trim()) throw new Error('access_notification_template_required');
-}
+function assertAccessNotification(rule: AccessNotificationRule): void {}
 
 function assertAccessPolicy(policy: AccessLifecyclePolicy): void {

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:85:7
  * the end of the period, and the text is never inspected: it is the owner's, variables included.
  */
 function assertAccessNotification(rule: AccessNotificationRule): void {
-  if (!Number.isSafeInteger(rule.offsetDays)) {
+  if (Number.isSafeInteger(rule.offsetDays)) {
     throw new Error('access_notification_offset_invalid');
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:85:47
  * the end of the period, and the text is never inspected: it is the owner's, variables included.
  */
 function assertAccessNotification(rule: AccessNotificationRule): void {
-  if (!Number.isSafeInteger(rule.offsetDays)) {
-    throw new Error('access_notification_offset_invalid');
-  }
+  if (!Number.isSafeInteger(rule.offsetDays)) {}
   const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
   if (!conditions.includes(rule.condition)) {

[Survived] ArrayDeclaration
src/modules/org-entitlements/service.ts:88:53
   if (!Number.isSafeInteger(rule.offsetDays)) {
     throw new Error('access_notification_offset_invalid');
   }
-  const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
+  const conditions: AccessNotificationCondition[] = [];
   if (!conditions.includes(rule.condition)) {
     throw new Error('access_notification_condition_invalid');

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:88:54
   if (!Number.isSafeInteger(rule.offsetDays)) {
     throw new Error('access_notification_offset_invalid');
   }
-  const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
+  const conditions: AccessNotificationCondition[] = ["", 'payment_failed'];
   if (!conditions.includes(rule.condition)) {
     throw new Error('access_notification_condition_invalid');

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:89:45
     throw new Error('access_notification_offset_invalid');
   }
   const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
-  if (!conditions.includes(rule.condition)) {
-    throw new Error('access_notification_condition_invalid');
-  }
+  if (!conditions.includes(rule.condition)) {}
   if (!rule.template.trim()) throw new Error('access_notification_template_required');
 }

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:89:7
     throw new Error('access_notification_offset_invalid');
   }
   const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
-  if (!conditions.includes(rule.condition)) {
+  if (conditions.includes(rule.condition)) {
     throw new Error('access_notification_condition_invalid');
   }

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:90:21
   }
   const conditions: AccessNotificationCondition[] = ['payment_succeeded', 'payment_failed'];
   if (!conditions.includes(rule.condition)) {
-    throw new Error('access_notification_condition_invalid');
+    throw new Error("");
   }
   if (!rule.template.trim()) throw new Error('access_notification_template_required');

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:92:7
   if (!conditions.includes(rule.condition)) {
     throw new Error('access_notification_condition_invalid');
   }
-  if (!rule.template.trim()) throw new Error('access_notification_template_required');
+  if (rule.template.trim()) throw new Error('access_notification_template_required');
 }
 

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:92:7
   if (!conditions.includes(rule.condition)) {
     throw new Error('access_notification_condition_invalid');
   }
-  if (!rule.template.trim()) throw new Error('access_notification_template_required');
+  if (false) throw new Error('access_notification_template_required');
 }
 

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:95:66
   if (!rule.template.trim()) throw new Error('access_notification_template_required');
 }
 
-function assertAccessPolicy(policy: AccessLifecyclePolicy): void {
-  for (const value of [policy.graceDays, policy.readOnlyDays]) {
-    if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
-  }
-  if (!Array.isArray(policy.notifications)) {
-    throw new Error('access_policy_notifications_invalid');
-  }
-  for (const rule of policy.notifications) assertAccessNotification(rule);
-  const terminalStates: AccessTerminalState[] = ['read_only', 'disabled'];
-  if (!terminalStates.includes(policy.terminalState)) {
-    throw new Error('access_policy_terminal_state_invalid');
-  }
-}
+function assertAccessPolicy(policy: AccessLifecyclePolicy): void {}
 
 /**

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:96:64
 }
 
 function assertAccessPolicy(policy: AccessLifecyclePolicy): void {
-  for (const value of [policy.graceDays, policy.readOnlyDays]) {
-    if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
-  }
+  for (const value of [policy.graceDays, policy.readOnlyDays]) {}
   if (!Array.isArray(policy.notifications)) {
     throw new Error('access_policy_notifications_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:97:9
 
 function assertAccessPolicy(policy: AccessLifecyclePolicy): void {
   for (const value of [policy.graceDays, policy.readOnlyDays]) {
-    if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
+    if (true) throw new Error('access_policy_value_invalid');
   }
   if (!Array.isArray(policy.notifications)) {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:97:41
 
 function assertAccessPolicy(policy: AccessLifecyclePolicy): void {
   for (const value of [policy.graceDays, policy.readOnlyDays]) {
-    if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
+    if (!Number.isSafeInteger(value) || value >= 0) throw new Error('access_policy_value_invalid');
   }
   if (!Array.isArray(policy.notifications)) {

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:99:7
   for (const value of [policy.graceDays, policy.readOnlyDays]) {
     if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
   }
-  if (!Array.isArray(policy.notifications)) {
+  if (Array.isArray(policy.notifications)) {
     throw new Error('access_policy_notifications_invalid');
   }

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:99:45
   for (const value of [policy.graceDays, policy.readOnlyDays]) {
     if (!Number.isSafeInteger(value) || value < 0) throw new Error('access_policy_value_invalid');
   }
-  if (!Array.isArray(policy.notifications)) {
-    throw new Error('access_policy_notifications_invalid');
-  }
+  if (!Array.isArray(policy.notifications)) {}
   for (const rule of policy.notifications) assertAccessNotification(rule);
   const terminalStates: AccessTerminalState[] = ['read_only', 'disabled'];

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:103:63
     throw new Error('access_policy_notifications_invalid');
   }
   for (const rule of policy.notifications) assertAccessNotification(rule);
-  const terminalStates: AccessTerminalState[] = ['read_only', 'disabled'];
+  const terminalStates: AccessTerminalState[] = ['read_only', ""];
   if (!terminalStates.includes(policy.terminalState)) {
     throw new Error('access_policy_terminal_state_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:104:7
   }
   for (const rule of policy.notifications) assertAccessNotification(rule);
   const terminalStates: AccessTerminalState[] = ['read_only', 'disabled'];
-  if (!terminalStates.includes(policy.terminalState)) {
+  if (true) {
     throw new Error('access_policy_terminal_state_invalid');
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:104:55
   }
   for (const rule of policy.notifications) assertAccessNotification(rule);
   const terminalStates: AccessTerminalState[] = ['read_only', 'disabled'];
-  if (!terminalStates.includes(policy.terminalState)) {
-    throw new Error('access_policy_terminal_state_invalid');
-  }
+  if (!terminalStates.includes(policy.terminalState)) {}
 }
 

[Survived] ObjectLiteral
src/modules/org-entitlements/service.ts:116:110
  * (owner 30.07, #4a.1 — overage is billed, not blocked) and critical (`никогда`) mechanics never
  * leave the tariff, so neither gets a downgrade policy.
  */
-const DOWNGRADE_POLICY_VALUES_BY_CLASS: Partial<Record<MechanicClass, readonly MechanicDowngradePolicy[]>> = {
-  запас: ['block', 'freeze_growth'],
-  объём: ['block', 'freeze_growth'],
-  возможность: ['block', 'disable_immediately', 'read_only'],
-};
+const DOWNGRADE_POLICY_VALUES_BY_CLASS: Partial<Record<MechanicClass, readonly MechanicDowngradePolicy[]>> = {};
 
 function assertDowngradePolicy(mechanic: OrgMechanic, value: string): asserts value is MechanicDowngradePolicy {

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:117:20
  * leave the tariff, so neither gets a downgrade policy.
  */
 const DOWNGRADE_POLICY_VALUES_BY_CLASS: Partial<Record<MechanicClass, readonly MechanicDowngradePolicy[]>> = {
-  запас: ['block', 'freeze_growth'],
+  запас: ['block', ""],
   объём: ['block', 'freeze_growth'],
   возможность: ['block', 'disable_immediately', 'read_only'],

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:118:20
  */
 const DOWNGRADE_POLICY_VALUES_BY_CLASS: Partial<Record<MechanicClass, readonly MechanicDowngradePolicy[]>> = {
   запас: ['block', 'freeze_growth'],
-  объём: ['block', 'freeze_growth'],
+  объём: ['block', ""],
   возможность: ['block', 'disable_immediately', 'read_only'],
 };

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:122:112
   возможность: ['block', 'disable_immediately', 'read_only'],
 };
 
-function assertDowngradePolicy(mechanic: OrgMechanic, value: string): asserts value is MechanicDowngradePolicy {
-  const allowed = DOWNGRADE_POLICY_VALUES_BY_CLASS[MECHANIC_REGISTRY[mechanic].class];
-  if (!allowed || !(allowed as readonly string[]).includes(value)) {
-    throw new Error('tariff_downgrade_policy_invalid');
-  }
-}
+function assertDowngradePolicy(mechanic: OrgMechanic, value: string): asserts value is MechanicDowngradePolicy {}
 
 function normalizeTariffInput(input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>) {

[NoCoverage] BooleanLiteral
src/modules/org-entitlements/service.ts:124:7
 
 function assertDowngradePolicy(mechanic: OrgMechanic, value: string): asserts value is MechanicDowngradePolicy {
   const allowed = DOWNGRADE_POLICY_VALUES_BY_CLASS[MECHANIC_REGISTRY[mechanic].class];
-  if (!allowed || !(allowed as readonly string[]).includes(value)) {
+  if (allowed || !(allowed as readonly string[]).includes(value)) {
     throw new Error('tariff_downgrade_policy_invalid');
   }

[NoCoverage] BooleanLiteral
src/modules/org-entitlements/service.ts:124:19
 
 function assertDowngradePolicy(mechanic: OrgMechanic, value: string): asserts value is MechanicDowngradePolicy {
   const allowed = DOWNGRADE_POLICY_VALUES_BY_CLASS[MECHANIC_REGISTRY[mechanic].class];
-  if (!allowed || !(allowed as readonly string[]).includes(value)) {
+  if (!allowed || (allowed as readonly string[]).includes(value)) {
     throw new Error('tariff_downgrade_policy_invalid');
   }

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:133:5
   const name = input.name.trim();
   if (!name) throw new Error('tariff_name_required');
   if (
-    input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    input.priceMinor !== null || !Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0
   ) {
     throw new Error('tariff_price_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:133:5
   const name = input.name.trim();
   if (!name) throw new Error('tariff_name_required');
   if (
-    input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    true
   ) {
     throw new Error('tariff_price_invalid');
