[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:134:6
   if (!name) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    (Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
   ) {
     throw new Error('tariff_price_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:134:49
   if (!name) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    (!Number.isSafeInteger(input.priceMinor) || false)
   ) {
     throw new Error('tariff_price_invalid');

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:138:36
   ) {
     throw new Error('tariff_price_invalid');
   }
-  if (input.priceMinor !== null && !input.currency?.trim())
+  if (input.priceMinor !== null && input.currency?.trim())
     throw new Error('tariff_currency_required');
   // §5a item 2.6a (owner 31.07): «количество разрешённых специалистов должно быть явно настроено

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:138:7
   ) {
     throw new Error('tariff_price_invalid');
   }
-  if (input.priceMinor !== null && !input.currency?.trim())
+  if (input.priceMinor !== null || !input.currency?.trim())
     throw new Error('tariff_currency_required');
   // §5a item 2.6a (owner 31.07): «количество разрешённых специалистов должно быть явно настроено

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:144:7
   // в тарифе, иначе он не сохранится». Fixed by refusing the SAVE, deliberately not by a runtime
   // substitution: neither "empty → unlimited" nor "empty → count one" may exist, because "empty"
   // must not exist in the database at all.
-  if (input.includedSeats === null) throw new Error('tariff_included_seats_required');
+  if (input.includedSeats !== null) throw new Error('tariff_included_seats_required');
   if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
     throw new Error('tariff_seat_limit_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:144:7
   // в тарифе, иначе он не сохранится». Fixed by refusing the SAVE, deliberately not by a runtime
   // substitution: neither "empty → unlimited" nor "empty → count one" may exist, because "empty"
   // must not exist in the database at all.
-  if (input.includedSeats === null) throw new Error('tariff_included_seats_required');
+  if (true) throw new Error('tariff_included_seats_required');
   if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
     throw new Error('tariff_seat_limit_invalid');

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:145:53
   // substitution: neither "empty → unlimited" nor "empty → count one" may exist, because "empty"
   // must not exist in the database at all.
   if (input.includedSeats === null) throw new Error('tariff_included_seats_required');
-  if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
+  if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats <= 0) {
     throw new Error('tariff_seat_limit_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:145:7
   // substitution: neither "empty → unlimited" nor "empty → count one" may exist, because "empty"
   // must not exist in the database at all.
   if (input.includedSeats === null) throw new Error('tariff_included_seats_required');
-  if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
+  if (true) {
     throw new Error('tariff_seat_limit_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:148:7
   if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
     throw new Error('tariff_seat_limit_invalid');
   }
-  if (input.systemAccessPolicy) assertAccessPolicy(input.systemAccessPolicy);
+  if (false) assertAccessPolicy(input.systemAccessPolicy);
   const mechanicAccessPolicies = {} as Tariff['mechanicAccessPolicies'];
   for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:148:7
   if (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0) {
     throw new Error('tariff_seat_limit_invalid');
   }
-  if (input.systemAccessPolicy) assertAccessPolicy(input.systemAccessPolicy);
+  if (true) assertAccessPolicy(input.systemAccessPolicy);
   const mechanicAccessPolicies = {} as Tariff['mechanicAccessPolicies'];
   for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:150:82
   }
   if (input.systemAccessPolicy) assertAccessPolicy(input.systemAccessPolicy);
   const mechanicAccessPolicies = {} as Tariff['mechanicAccessPolicies'];
-  for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {
-    assertMechanic(mechanic);
-    if (!policy) continue;
-    assertAccessPolicy(policy);
-    if (MECHANIC_REGISTRY[mechanic].class === 'никогда') {
-      throw new Error('critical_mechanic_access_policy_forbidden');
-    }
-    mechanicAccessPolicies[mechanic] = policy;
-  }
+  for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {}
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:152:9
   const mechanicAccessPolicies = {} as Tariff['mechanicAccessPolicies'];
   for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {
     assertMechanic(mechanic);
-    if (!policy) continue;
+    if (policy) continue;
     assertAccessPolicy(policy);
     if (MECHANIC_REGISTRY[mechanic].class === 'никогда') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:152:9
   const mechanicAccessPolicies = {} as Tariff['mechanicAccessPolicies'];
   for (const [mechanic, policy] of Object.entries(input.mechanicAccessPolicies)) {
     assertMechanic(mechanic);
-    if (!policy) continue;
+    if (true) continue;
     assertAccessPolicy(policy);
     if (MECHANIC_REGISTRY[mechanic].class === 'никогда') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:154:9
     assertMechanic(mechanic);
     if (!policy) continue;
     assertAccessPolicy(policy);
-    if (MECHANIC_REGISTRY[mechanic].class === 'никогда') {
+    if (true) {
       throw new Error('critical_mechanic_access_policy_forbidden');
     }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:154:9
     assertMechanic(mechanic);
     if (!policy) continue;
     assertAccessPolicy(policy);
-    if (MECHANIC_REGISTRY[mechanic].class === 'никогда') {
+    if (false) {
       throw new Error('critical_mechanic_access_policy_forbidden');
     }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:161:37
   }
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
-  for (const mechanic of MECHANICS) {
-    if (MECHANIC_REGISTRY[mechanic].class === 'возможность') {
-      mechanics[mechanic] = input.mechanics[mechanic] === true;
-    }
-  }
+  for (const mechanic of MECHANICS) {}
   const downgradePolicies: DowngradePolicyMap = {};
   for (const [mechanic, value] of Object.entries(input.downgradePolicies)) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:162:9
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
   for (const mechanic of MECHANICS) {
-    if (MECHANIC_REGISTRY[mechanic].class === 'возможность') {
+    if (true) {
       mechanics[mechanic] = input.mechanics[mechanic] === true;
     }

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:162:9
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
   for (const mechanic of MECHANICS) {
-    if (MECHANIC_REGISTRY[mechanic].class === 'возможность') {
+    if (MECHANIC_REGISTRY[mechanic].class !== 'возможность') {
       mechanics[mechanic] = input.mechanics[mechanic] === true;
     }

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:163:59
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
   for (const mechanic of MECHANICS) {
     if (MECHANIC_REGISTRY[mechanic].class === 'возможность') {
-      mechanics[mechanic] = input.mechanics[mechanic] === true;
+      mechanics[mechanic] = input.mechanics[mechanic] === false;
     }
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:163:29
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
   for (const mechanic of MECHANICS) {
     if (MECHANIC_REGISTRY[mechanic].class === 'возможность') {
-      mechanics[mechanic] = input.mechanics[mechanic] === true;
+      mechanics[mechanic] = true;
     }
   }

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:167:76
     }
   }
   const downgradePolicies: DowngradePolicyMap = {};
-  for (const [mechanic, value] of Object.entries(input.downgradePolicies)) {
-    assertMechanic(mechanic);
-    if (!value) continue;
-    assertDowngradePolicy(mechanic, value);
-    downgradePolicies[mechanic] = value;
-  }
+  for (const [mechanic, value] of Object.entries(input.downgradePolicies)) {}
   return {
     ...input,

[NoCoverage] BooleanLiteral
src/modules/org-entitlements/service.ts:169:9
   const downgradePolicies: DowngradePolicyMap = {};
   for (const [mechanic, value] of Object.entries(input.downgradePolicies)) {
     assertMechanic(mechanic);
-    if (!value) continue;
+    if (value) continue;
     assertDowngradePolicy(mechanic, value);
     downgradePolicies[mechanic] = value;

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:169:9
   const downgradePolicies: DowngradePolicyMap = {};
   for (const [mechanic, value] of Object.entries(input.downgradePolicies)) {
     assertMechanic(mechanic);
-    if (!value) continue;
+    if (true) continue;
     assertDowngradePolicy(mechanic, value);
     downgradePolicies[mechanic] = value;

[Survived] ObjectLiteral
src/modules/org-entitlements/service.ts:173:10
     assertDowngradePolicy(mechanic, value);
     downgradePolicies[mechanic] = value;
   }
-  return {
-    ...input,
-    name,
-    description: input.description.trim(),
-    currency: input.currency?.trim().toUpperCase() ?? null,
-    mechanics,
-    quotas: normalizeQuotaMap(input.quotas),
-    mechanicAccessPolicies,
-    downgradePolicies,
-  };
+  return {};
 }
 

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:177:15
     ...input,
     name,
     description: input.description.trim(),
-    currency: input.currency?.trim().toUpperCase() ?? null,
+    currency: input.currency?.trim().toUpperCase() && null,
     mechanics,
     quotas: normalizeQuotaMap(input.quotas),

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:185:55
   };
 }
 
-function assertTrialPolicy(policy: TrialPolicy): void {
-  if (!policy.startEvent.trim()) throw new Error('trial_start_event_required');
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
-    throw new Error('trial_duration_invalid');
-  }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
-    throw new Error('trial_grace_invalid');
-  }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
-    throw new Error('trial_post_tariff_required');
-  }
-  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
-    throw new Error('trial_post_tariff_forbidden');
-  }
-}
+function assertTrialPolicy(policy: TrialPolicy): void {}
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:186:8
 }
 
 function assertTrialPolicy(policy: TrialPolicy): void {
-  if (!policy.startEvent.trim()) throw new Error('trial_start_event_required');
+  if (!policy.startEvent) throw new Error('trial_start_event_required');
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:186:7
 }
 
 function assertTrialPolicy(policy: TrialPolicy): void {
-  if (!policy.startEvent.trim()) throw new Error('trial_start_event_required');
+  if (false) throw new Error('trial_start_event_required');
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:187:7
 
 function assertTrialPolicy(policy: TrialPolicy): void {
   if (!policy.startEvent.trim()) throw new Error('trial_start_event_required');
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
+  if (false) {
     throw new Error('trial_duration_invalid');
   }

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:187:7
 
 function assertTrialPolicy(policy: TrialPolicy): void {
   if (!policy.startEvent.trim()) throw new Error('trial_start_event_required');
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
+  if (!Number.isSafeInteger(policy.durationDays) && policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:190:50
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');
   }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
+  if (!Number.isSafeInteger(policy.graceDays) || false) {
     throw new Error('trial_grace_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:190:7
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');
   }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
+  if (true) {
     throw new Error('trial_grace_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:193:7
   if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
     throw new Error('trial_grace_invalid');
   }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
+  if (true) {
     throw new Error('trial_post_tariff_required');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:193:7
   if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
     throw new Error('trial_grace_invalid');
   }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
+  if (true && !policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');
   }

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:196:7
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');
   }
-  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
+  if (policy.postTrialBehavior === 'tariff' && policy.postTrialTariffId !== null) {
     throw new Error('trial_post_tariff_forbidden');
   }

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:202:24
 }
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {
-  return !expiresAt || new Date(expiresAt).getTime() > Date.now();
+  return !expiresAt || new Date(expiresAt).getTime() <= Date.now();
 }
 

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:202:24
 }
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {
-  return !expiresAt || new Date(expiresAt).getTime() > Date.now();
+  return !expiresAt || new Date(expiresAt).getTime() >= Date.now();
 }
 

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:213:28
 function numericQuotaFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides'>,
   mechanic: OrgMechanic,
-): TariffQuota | undefined {
-  const override = snapshot.overrides.find(
-    (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
-  );
-  return (
-    override?.quota ??
-    (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)?.[mechanic]
-  );
-}
+): TariffQuota | undefined {}
 
 function requiresExplicitNumericQuota(mechanicClass: MechanicClass): boolean {
killedBy: §5a stage 6.2 — platform report names who is over a numeric limit and their ladder step flags an organization whose usage has reached its configured limit
statusReason: expected [] to deeply equal ArrayContaining{…}

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:215:16
   mechanic: OrgMechanic,
 ): TariffQuota | undefined {
   const override = snapshot.overrides.find(
-    (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
+    (entry) => true,
   );
   return (

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:215:16
   mechanic: OrgMechanic,
 ): TariffQuota | undefined {
   const override = snapshot.overrides.find(
-    (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
+    (entry) => true && isOverrideActive(entry.expiresAt),
   );
   return (

[Killed] LogicalOperator
src/modules/org-entitlements/service.ts:218:5
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
   return (
-    override?.quota ??
-    (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)?.[mechanic]
+    override?.quota && (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)?.[mechanic]
   );
 }
killedBy: §5a stage 6.2 — platform report names who is over a numeric limit and their ladder step flags an organization whose usage has reached its configured limit
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] OptionalChaining
src/modules/org-entitlements/service.ts:218:5
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
   return (
-    override?.quota ??
+    override.quota ??
     (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)?.[mechanic]
   );
killedBy: §5a stage 6.2 — platform report names who is over a numeric limit and their ladder step flags an organization whose usage has reached its configured limit
statusReason: expected [] to deeply equal ArrayContaining{…}

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:219:5
   );
   return (
     override?.quota ??
-    (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)?.[mechanic]
+    (snapshot.tariff?.quotas as Partial<Record<OrgMechanic, TariffQuota>> | undefined)[mechanic]
   );
 }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:223:78
   );
 }
 
-function requiresExplicitNumericQuota(mechanicClass: MechanicClass): boolean {
-  return mechanicClass === 'объём' || mechanicClass === 'запас';
-}
+function requiresExplicitNumericQuota(mechanicClass: MechanicClass): boolean {}
 
 function isMechanicIncludedFromSnapshot(

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:224:39
 }
 
 function requiresExplicitNumericQuota(mechanicClass: MechanicClass): boolean {
-  return mechanicClass === 'объём' || mechanicClass === 'запас';
+  return mechanicClass === 'объём' || false;
 }
 

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:224:10
 }
 
 function requiresExplicitNumericQuota(mechanicClass: MechanicClass): boolean {
-  return mechanicClass === 'объём' || mechanicClass === 'запас';
+  return true;
 }
 

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:230:12
 function isMechanicIncludedFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
   mechanic: OrgMechanic,
-): boolean {
-  const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-  if (mechanicClass === 'никогда') return true;
-  const override = snapshot.overrides.find(
-    (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
-  );
-  if (override) return override.enabled;
-  if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
-  if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
-  if (requiresExplicitNumericQuota(mechanicClass)) {
-    return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
-  }
-  return snapshot.tariff.mechanics[mechanic] === true;
-}
+): boolean {}
 
 /**

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:232:7
   mechanic: OrgMechanic,
 ): boolean {
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-  if (mechanicClass === 'никогда') return true;
+  if (mechanicClass !== 'никогда') return true;
   const override = snapshot.overrides.find(
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:232:43
   mechanic: OrgMechanic,
 ): boolean {
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-  if (mechanicClass === 'никогда') return true;
+  if (mechanicClass === 'никогда') return false;
   const override = snapshot.overrides.find(
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:234:16
   const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
   if (mechanicClass === 'никогда') return true;
   const override = snapshot.overrides.find(
-    (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
+    (entry) => entry.mechanic === mechanic || isOverrideActive(entry.expiresAt),
   );
   if (override) return override.enabled;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:236:7
   const override = snapshot.overrides.find(
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
-  if (override) return override.enabled;
+  if (false) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:236:7
   const override = snapshot.overrides.find(
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
-  if (override) return override.enabled;
+  if (true) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:237:32
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
   if (override) return override.enabled;
-  if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
+  if (!snapshot.tariff) return false;
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:237:32
     (entry) => entry.mechanic === mechanic && isOverrideActive(entry.expiresAt),
   );
   if (override) return override.enabled;
-  if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
+  if (!snapshot.tariff) return snapshot.access.source !== 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:238:7
   );
   if (override) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
-  if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
+  if (mechanicClass !== 'места') return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {
     return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:238:7
   );
   if (override) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
-  if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
+  if (true) return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {
     return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:239:7
   if (override) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
-  if (requiresExplicitNumericQuota(mechanicClass)) {
+  if (true) {
     return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:239:52
   if (override) return override.enabled;
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
-  if (requiresExplicitNumericQuota(mechanicClass)) {
-    return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
-  }
+  if (requiresExplicitNumericQuota(mechanicClass)) {}
   return snapshot.tariff.mechanics[mechanic] === true;
 }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:240:12
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {
-    return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
+    return false;
   }
   return snapshot.tariff.mechanics[mechanic] === true;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:240:12
   if (!snapshot.tariff) return snapshot.access.source === 'compatibility';
   if (mechanicClass === 'места') return snapshot.tariff.includedSeats !== null;
   if (requiresExplicitNumericQuota(mechanicClass)) {
-    return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
+    return true;
   }
   return snapshot.tariff.mechanics[mechanic] === true;

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:242:10
   if (requiresExplicitNumericQuota(mechanicClass)) {
     return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
   }
-  return snapshot.tariff.mechanics[mechanic] === true;
+  return snapshot.tariff.mechanics[mechanic] !== true;
 }
 

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:242:50
   if (requiresExplicitNumericQuota(mechanicClass)) {
     return numericQuotaFromSnapshot(snapshot, mechanic) !== undefined;
   }
-  return snapshot.tariff.mechanics[mechanic] === true;
+  return snapshot.tariff.mechanics[mechanic] === false;
 }
 

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:257:30
  */
 export function fileStorageLimitFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
-): number | null | undefined {
-  if (snapshot.access.source === 'compatibility') return null;
-  if (!snapshot.tariff) return undefined;
-  const quota = numericQuotaFromSnapshot(snapshot, 'files');
-  if (!quota) return undefined;
-  return quota.kind === 'numeric' ? quota.limit : null;
-}
+): number | null | undefined {}
 
 /**
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: expected { ok: false, …(1) } to match object { error: 'file_storage_limit_reached' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/modules/org-entitlements/service.ts:258:7
 export function fileStorageLimitFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): number | null | undefined {
-  if (snapshot.access.source === 'compatibility') return null;
+  if (true) return null;
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the assigned tariff has no file limit
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/modules/org-entitlements/service.ts:258:7
 export function fileStorageLimitFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): number | null | undefined {
-  if (snapshot.access.source === 'compatibility') return null;
+  if (snapshot.access.source !== 'compatibility') return null;
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the assigned tariff has no file limit
statusReason: Cannot read properties of undefined (reading 'id')
