[Survived] BlockStatement
src/modules/org-entitlements/service.ts:18:70
 } from './types';
 import type { OrgEntitlementsPort, PlatformEntitlementsPort, PlatformMutationAudit } from './ports';
 
-function assertMechanic(value: string): asserts value is OrgMechanic {
-  if (!MECHANICS.includes(value as OrgMechanic)) throw new Error('entitlement_mechanic_invalid');
-}
+function assertMechanic(value: string): asserts value is OrgMechanic {}
 
 function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:19:7
 import type { OrgEntitlementsPort, PlatformEntitlementsPort, PlatformMutationAudit } from './ports';
 
 function assertMechanic(value: string): asserts value is OrgMechanic {
-  if (!MECHANICS.includes(value as OrgMechanic)) throw new Error('entitlement_mechanic_invalid');
+  if (true) throw new Error('entitlement_mechanic_invalid');
 }
 

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:19:7
 import type { OrgEntitlementsPort, PlatformEntitlementsPort, PlatformMutationAudit } from './ports';
 
 function assertMechanic(value: string): asserts value is OrgMechanic {
-  if (!MECHANICS.includes(value as OrgMechanic)) throw new Error('entitlement_mechanic_invalid');
+  if (MECHANICS.includes(value as OrgMechanic)) throw new Error('entitlement_mechanic_invalid');
 }
 

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:22:71
   if (!MECHANICS.includes(value as OrgMechanic)) throw new Error('entitlement_mechanic_invalid');
 }
 
-function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {
-  if (!MECHANIC_REGISTRY[mechanic].quotaUnits.includes(quota.unit as never)) {
-    throw new Error('tariff_quota_unit_invalid');
-  }
-  if (
-    (mechanic === 'courses' || mechanic === 'cms_pages') &&
-    (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
-  ) {
-    throw new Error('tariff_quota_enforcement_shape_invalid');
-  }
-  if (quota.kind === 'unlimited') {
-    if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
-    return;
-  }
-  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
-    throw new Error('tariff_quota_limit_invalid');
-  }
-}
+function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {}
 
 function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:23:78
 }
 
 function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {
-  if (!MECHANIC_REGISTRY[mechanic].quotaUnits.includes(quota.unit as never)) {
-    throw new Error('tariff_quota_unit_invalid');
-  }
+  if (!MECHANIC_REGISTRY[mechanic].quotaUnits.includes(quota.unit as never)) {}
   if (
     (mechanic === 'courses' || mechanic === 'cms_pages') &&

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:23:7
 }
 
 function assertQuota(mechanic: OrgMechanic, quota: TariffQuota): void {
-  if (!MECHANIC_REGISTRY[mechanic].quotaUnits.includes(quota.unit as never)) {
+  if (false) {
     throw new Error('tariff_quota_unit_invalid');
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:27:6
     throw new Error('tariff_quota_unit_invalid');
   }
   if (
-    (mechanic === 'courses' || mechanic === 'cms_pages') &&
+    (true) &&
     (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
   ) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:27:5
     throw new Error('tariff_quota_unit_invalid');
   }
   if (
-    (mechanic === 'courses' || mechanic === 'cms_pages') &&
-    (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
+    false
   ) {
     throw new Error('tariff_quota_enforcement_shape_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:28:6
   }
   if (
     (mechanic === 'courses' || mechanic === 'cms_pages') &&
-    (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
+    (true)
   ) {
     throw new Error('tariff_quota_enforcement_shape_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:28:6
   }
   if (
     (mechanic === 'courses' || mechanic === 'cms_pages') &&
-    (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
+    (false || quota.usagePolicy !== 'snapshot')
   ) {
     throw new Error('tariff_quota_enforcement_shape_invalid');

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:29:5
   if (
     (mechanic === 'courses' || mechanic === 'cms_pages') &&
     (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
-  ) {
-    throw new Error('tariff_quota_enforcement_shape_invalid');
-  }
+  ) {}
   if (quota.kind === 'unlimited') {
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:30:21
     (mechanic === 'courses' || mechanic === 'cms_pages') &&
     (quota.unit !== 'items' || quota.period !== 'snapshot' || quota.usagePolicy !== 'snapshot')
   ) {
-    throw new Error('tariff_quota_enforcement_shape_invalid');
+    throw new Error("");
   }
   if (quota.kind === 'unlimited') {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:32:7
   ) {
     throw new Error('tariff_quota_enforcement_shape_invalid');
   }
-  if (quota.kind === 'unlimited') {
+  if (quota.kind !== 'unlimited') {
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:32:35
   ) {
     throw new Error('tariff_quota_enforcement_shape_invalid');
   }
-  if (quota.kind === 'unlimited') {
-    if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
-    return;
-  }
+  if (quota.kind === 'unlimited') {}
   if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
     throw new Error('tariff_quota_limit_invalid');

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:33:9
     throw new Error('tariff_quota_enforcement_shape_invalid');
   }
   if (quota.kind === 'unlimited') {
-    if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
+    if (quota.limit === null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:33:9
     throw new Error('tariff_quota_enforcement_shape_invalid');
   }
   if (quota.kind === 'unlimited') {
-    if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
+    if (false) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:36:70
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }
-  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
-    throw new Error('tariff_quota_limit_invalid');
-  }
+  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {}
 }
 

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:36:7
     if (quota.limit !== null) throw new Error('tariff_quota_unlimited_limit_invalid');
     return;
   }
-  if (!Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
+  if (Number.isSafeInteger(quota.limit) || (quota.limit ?? -1) < 0) {
     throw new Error('tariff_quota_limit_invalid');
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:41:68
   }
 }
 
-function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
-  const normalized: TariffQuotaMap = {};
-  for (const [key, value] of Object.entries(quotas)) {
-    if (!MECHANICS.includes(key as OrgMechanic) || !value)
-      throw new Error('tariff_quota_mechanic_invalid');
-    assertQuota(key as OrgMechanic, value);
-    normalized[key as OrgMechanic] = value;
-  }
-  return normalized;
-}
+function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {}
 
 function normalizeTariffInput(input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>) {

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:43:54
 
 function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
   const normalized: TariffQuotaMap = {};
-  for (const [key, value] of Object.entries(quotas)) {
-    if (!MECHANICS.includes(key as OrgMechanic) || !value)
-      throw new Error('tariff_quota_mechanic_invalid');
-    assertQuota(key as OrgMechanic, value);
-    normalized[key as OrgMechanic] = value;
-  }
+  for (const [key, value] of Object.entries(quotas)) {}
   return normalized;
 }

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:44:9
 function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
   const normalized: TariffQuotaMap = {};
   for (const [key, value] of Object.entries(quotas)) {
-    if (!MECHANICS.includes(key as OrgMechanic) || !value)
+    if (MECHANICS.includes(key as OrgMechanic) || !value)
       throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key as OrgMechanic, value);

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:44:52
 function normalizeQuotaMap(quotas: TariffQuotaMap): TariffQuotaMap {
   const normalized: TariffQuotaMap = {};
   for (const [key, value] of Object.entries(quotas)) {
-    if (!MECHANICS.includes(key as OrgMechanic) || !value)
+    if (!MECHANICS.includes(key as OrgMechanic) || value)
       throw new Error('tariff_quota_mechanic_invalid');
     assertQuota(key as OrgMechanic, value);

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:45:23
   const normalized: TariffQuotaMap = {};
   for (const [key, value] of Object.entries(quotas)) {
     if (!MECHANICS.includes(key as OrgMechanic) || !value)
-      throw new Error('tariff_quota_mechanic_invalid');
+      throw new Error("");
     assertQuota(key as OrgMechanic, value);
     normalized[key as OrgMechanic] = value;

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:53:16
 }
 
 function normalizeTariffInput(input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>) {
-  const name = input.name.trim();
+  const name = input.name;
   if (!name) throw new Error('tariff_name_required');
   if (

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:54:7
 
 function normalizeTariffInput(input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>) {
   const name = input.name.trim();
-  if (!name) throw new Error('tariff_name_required');
+  if (true) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:54:7
 
 function normalizeTariffInput(input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>) {
   const name = input.name.trim();
-  if (!name) throw new Error('tariff_name_required');
+  if (false) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:56:5
   const name = input.name.trim();
   if (!name) throw new Error('tariff_name_required');
   if (
-    input.priceMinor !== null &&
+    input.priceMinor === null &&
     (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
   ) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:56:5
   const name = input.name.trim();
   if (!name) throw new Error('tariff_name_required');
   if (
-    input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    false
   ) {
     throw new Error('tariff_price_invalid');

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:57:6
   if (!name) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    (!Number.isSafeInteger(input.priceMinor) && input.priceMinor < 0)
   ) {
     throw new Error('tariff_price_invalid');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:57:6
   if (!name) throw new Error('tariff_name_required');
   if (
     input.priceMinor !== null &&
-    (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
+    (true)
   ) {
     throw new Error('tariff_price_invalid');

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:58:5
   if (
     input.priceMinor !== null &&
     (!Number.isSafeInteger(input.priceMinor) || input.priceMinor < 0)
-  ) {
-    throw new Error('tariff_price_invalid');
-  }
+  ) {}
   if (input.priceMinor !== null && !input.currency?.trim())
     throw new Error('tariff_currency_required');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:61:7
   ) {
     throw new Error('tariff_price_invalid');
   }
-  if (input.priceMinor !== null && !input.currency?.trim())
+  if (true)
     throw new Error('tariff_currency_required');
   if (

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:61:7
   ) {
     throw new Error('tariff_price_invalid');
   }
-  if (input.priceMinor !== null && !input.currency?.trim())
+  if (true && !input.currency?.trim())
     throw new Error('tariff_currency_required');
   if (

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:64:5
   if (input.priceMinor !== null && !input.currency?.trim())
     throw new Error('tariff_currency_required');
   if (
-    input.includedSeats !== null &&
-    (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0)
+    input.includedSeats !== null || !Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0
   ) {
     throw new Error('tariff_seat_limit_invalid');

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:64:5
   if (input.priceMinor !== null && !input.currency?.trim())
     throw new Error('tariff_currency_required');
   if (
-    input.includedSeats !== null &&
+    input.includedSeats === null &&
     (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0)
   ) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:65:52
     throw new Error('tariff_currency_required');
   if (
     input.includedSeats !== null &&
-    (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0)
+    (!Number.isSafeInteger(input.includedSeats) || false)
   ) {
     throw new Error('tariff_seat_limit_invalid');

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:65:52
     throw new Error('tariff_currency_required');
   if (
     input.includedSeats !== null &&
-    (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0)
+    (!Number.isSafeInteger(input.includedSeats) || input.includedSeats <= 0)
   ) {
     throw new Error('tariff_seat_limit_invalid');

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:66:5
   if (
     input.includedSeats !== null &&
     (!Number.isSafeInteger(input.includedSeats) || input.includedSeats < 0)
-  ) {
-    throw new Error('tariff_seat_limit_invalid');
-  }
+  ) {}
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:71:89
   }
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
-  for (const mechanic of MECHANICS) mechanics[mechanic] = input.mechanics[mechanic] === true;
+  for (const mechanic of MECHANICS) mechanics[mechanic] = input.mechanics[mechanic] === false;
   return {
     ...input,

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:71:59
   }
   const mechanics: Record<string, boolean> = {};
   for (const mechanic of Object.keys(input.mechanics)) assertMechanic(mechanic);
-  for (const mechanic of MECHANICS) mechanics[mechanic] = input.mechanics[mechanic] === true;
+  for (const mechanic of MECHANICS) mechanics[mechanic] = true;
   return {
     ...input,

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:75:18
   return {
     ...input,
     name,
-    description: input.description.trim(),
+    description: input.description,
     currency: input.currency?.trim().toUpperCase() ?? null,
     mechanics,

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:76:15
     ...input,
     name,
     description: input.description.trim(),
-    currency: input.currency?.trim().toUpperCase() ?? null,
+    currency: input.currency?.trim().toLowerCase() ?? null,
     mechanics,
     quotas: normalizeQuotaMap(input.quotas),

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:76:15
     ...input,
     name,
     description: input.description.trim(),
-    currency: input.currency?.trim().toUpperCase() ?? null,
+    currency: input.currency.trim().toUpperCase() ?? null,
     mechanics,
     quotas: normalizeQuotaMap(input.quotas),

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:82:55
   };
 }
 
-function assertTrialPolicy(policy: TrialPolicy): void {
-  if (policy.startEvent !== 'organization_provisioned') {
-    throw new Error('trial_start_event_unsupported');
-  }
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
-    throw new Error('trial_duration_invalid');
-  }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
-    throw new Error('trial_grace_invalid');
-  }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
-    throw new Error('trial_post_tariff_required');
-  }
-  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
-    throw new Error('trial_post_tariff_forbidden');
-  }
-}
+function assertTrialPolicy(policy: TrialPolicy): void {}
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:83:7
 }
 
 function assertTrialPolicy(policy: TrialPolicy): void {
-  if (policy.startEvent !== 'organization_provisioned') {
+  if (policy.startEvent === 'organization_provisioned') {
     throw new Error('trial_start_event_unsupported');
   }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:83:7
 }
 
 function assertTrialPolicy(policy: TrialPolicy): void {
-  if (policy.startEvent !== 'organization_provisioned') {
+  if (true) {
     throw new Error('trial_start_event_unsupported');
   }

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:86:53
   if (policy.startEvent !== 'organization_provisioned') {
     throw new Error('trial_start_event_unsupported');
   }
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
+  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays < 0) {
     throw new Error('trial_duration_invalid');
   }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:86:7
   if (policy.startEvent !== 'organization_provisioned') {
     throw new Error('trial_start_event_unsupported');
   }
-  if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
+  if (false) {
     throw new Error('trial_duration_invalid');
   }

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:89:72
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');
   }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
-    throw new Error('trial_grace_invalid');
-  }
+  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {}
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');

[NoCoverage] BooleanLiteral
src/modules/org-entitlements/service.ts:89:7
   if (!Number.isSafeInteger(policy.durationDays) || policy.durationDays <= 0) {
     throw new Error('trial_duration_invalid');
   }
-  if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
+  if (Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
     throw new Error('trial_grace_invalid');
   }

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:90:21
     throw new Error('trial_duration_invalid');
   }
   if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
-    throw new Error('trial_grace_invalid');
+    throw new Error("");
   }
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {

[NoCoverage] BooleanLiteral
src/modules/org-entitlements/service.ts:92:48
   if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
     throw new Error('trial_grace_invalid');
   }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
+  if (policy.postTrialBehavior === 'tariff' && policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');
   }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:92:7
   if (!Number.isSafeInteger(policy.graceDays) || policy.graceDays < 0) {
     throw new Error('trial_grace_invalid');
   }
-  if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
+  if (false) {
     throw new Error('trial_post_tariff_required');
   }

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:93:21
     throw new Error('trial_grace_invalid');
   }
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
-    throw new Error('trial_post_tariff_required');
+    throw new Error("");
   }
   if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {

[NoCoverage] LogicalOperator
src/modules/org-entitlements/service.ts:95:7
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');
   }
-  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
+  if (policy.postTrialBehavior !== 'tariff' || policy.postTrialTariffId !== null) {
     throw new Error('trial_post_tariff_forbidden');
   }

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:95:83
   if (policy.postTrialBehavior === 'tariff' && !policy.postTrialTariffId) {
     throw new Error('trial_post_tariff_required');
   }
-  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
-    throw new Error('trial_post_tariff_forbidden');
-  }
+  if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {}
 }
 

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:96:21
     throw new Error('trial_post_tariff_required');
   }
   if (policy.postTrialBehavior !== 'tariff' && policy.postTrialTariffId !== null) {
-    throw new Error('trial_post_tariff_forbidden');
+    throw new Error("");
   }
 }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:100:74
   }
 }
 
-function isOverrideActive(expiresAt: string | null | undefined): boolean {
-  return !expiresAt || new Date(expiresAt).getTime() > Date.now();
-}
+function isOverrideActive(expiresAt: string | null | undefined): boolean {}
 
 /**

[Killed] ConditionalExpression
src/modules/org-entitlements/service.ts:101:10
 }
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {
-  return !expiresAt || new Date(expiresAt).getTime() > Date.now();
+  return false;
 }
 
killedBy: resolveOrgEntitlements lets an org override enable clinic_team with no tariff
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:101:10
 }
 
 function isOverrideActive(expiresAt: string | null | undefined): boolean {
-  return !expiresAt || new Date(expiresAt).getTime() > Date.now();
+  return true;
 }
 

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:112:20
  */
 export function entitlementsFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
-): OrgEntitlements {
-  const overrideByMechanic = new Map(
-    snapshot.overrides
-      .filter((override) => isOverrideActive(override.expiresAt))
-      .map((override) => [override.mechanic, override.enabled]),
-  );
-  const result = {} as OrgEntitlements;
-  for (const mechanic of MECHANICS) {
-    result[mechanic] =
-      overrideByMechanic.get(mechanic) ??
-      snapshot.tariff?.mechanics[mechanic] ??
-      (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
-  }
-  return result;
-}
+): OrgEntitlements {}
 
 /**
killedBy: pgTreatmentTail15C (SQL parity) createPgTreatmentProgramItemSnapshotPort buildSnapshot enriches exercise media from media_files
statusReason: Cannot read properties of undefined (reading 'exercise_catalog')

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:114:5
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): OrgEntitlements {
   const overrideByMechanic = new Map(
-    snapshot.overrides
-      .filter((override) => isOverrideActive(override.expiresAt))
+    snapshot.overrides
       .map((override) => [override.mechanic, override.enabled]),
   );

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:115:15
 ): OrgEntitlements {
   const overrideByMechanic = new Map(
     snapshot.overrides
-      .filter((override) => isOverrideActive(override.expiresAt))
+      .filter(() => undefined)
       .map((override) => [override.mechanic, override.enabled]),
   );

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:116:12
   const overrideByMechanic = new Map(
     snapshot.overrides
       .filter((override) => isOverrideActive(override.expiresAt))
-      .map((override) => [override.mechanic, override.enabled]),
+      .map(() => undefined),
   );
   const result = {} as OrgEntitlements;

[Survived] ArrayDeclaration
src/modules/org-entitlements/service.ts:116:26
   const overrideByMechanic = new Map(
     snapshot.overrides
       .filter((override) => isOverrideActive(override.expiresAt))
-      .map((override) => [override.mechanic, override.enabled]),
+      .map((override) => []),
   );
   const result = {} as OrgEntitlements;

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:119:37
       .map((override) => [override.mechanic, override.enabled]),
   );
   const result = {} as OrgEntitlements;
-  for (const mechanic of MECHANICS) {
-    result[mechanic] =
-      overrideByMechanic.get(mechanic) ??
-      snapshot.tariff?.mechanics[mechanic] ??
-      (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
-  }
+  for (const mechanic of MECHANICS) {}
   return result;
 }
killedBy: legacy settings compatibility shows billing to owner and clinic admin, then denies it to a specialist
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, undefined ]

Received:

  1st vi.fn() call:

@@ -1,24 +1,89 @@
  [

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:121:7
   const result = {} as OrgEntitlements;
   for (const mechanic of MECHANICS) {
     result[mechanic] =
-      overrideByMechanic.get(mechanic) ??
-      snapshot.tariff?.mechanics[mechanic] ??
-      (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
+      (overrideByMechanic.get(mechanic) ?? snapshot.tariff?.mechanics[mechanic]) && (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
   }
   return result;

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:121:7
   const result = {} as OrgEntitlements;
   for (const mechanic of MECHANICS) {
     result[mechanic] =
-      overrideByMechanic.get(mechanic) ??
-      snapshot.tariff?.mechanics[mechanic] ??
+      overrideByMechanic.get(mechanic) && snapshot.tariff?.mechanics[mechanic] ??
       (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
   }

[Killed] OptionalChaining
src/modules/org-entitlements/service.ts:122:7
   for (const mechanic of MECHANICS) {
     result[mechanic] =
       overrideByMechanic.get(mechanic) ??
-      snapshot.tariff?.mechanics[mechanic] ??
+      snapshot.tariff.mechanics[mechanic] ??
       (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
   }
killedBy: legacy settings compatibility shows the honest empty state (no tariff) instead of a lie
statusReason: Cannot read properties of null (reading 'mechanics')

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:123:48
     result[mechanic] =
       overrideByMechanic.get(mechanic) ??
       snapshot.tariff?.mechanics[mechanic] ??
-      (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
+      (snapshot.access.source === 'no_trial' ? true : MECHANIC_DEFAULT_ENABLED[mechanic]);
   }
   return result;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:123:8
     result[mechanic] =
       overrideByMechanic.get(mechanic) ??
       snapshot.tariff?.mechanics[mechanic] ??
-      (snapshot.access.source === 'no_trial' ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
+      (true ? false : MECHANIC_DEFAULT_ENABLED[mechanic]);
   }
   return result;

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:141:5
     port.getEnforcedQuotaUsage(organizationId),
   ]);
   const activeOverrides = new Map(
-    snapshot.overrides
-      .filter((override) => isOverrideActive(override.expiresAt))
+    snapshot.overrides
       .map((override) => [override.mechanic, override]),
   );
