[Killed] BooleanLiteral
src/modules/org-entitlements/service.ts:259:7
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): number | null | undefined {
   if (snapshot.access.source === 'compatibility') return null;
-  if (!snapshot.tariff) return undefined;
+  if (snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
   if (!quota) return undefined;
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: expected { ok: false, …(1) } to match object { error: 'file_storage_limit_reached' }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/modules/org-entitlements/service.ts:259:7
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): number | null | undefined {
   if (snapshot.access.source === 'compatibility') return null;
-  if (!snapshot.tariff) return undefined;
+  if (true) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
   if (!quota) return undefined;
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: expected { ok: false, …(1) } to match object { error: 'file_storage_limit_reached' }
(1 matching property omitted from actual)

[Killed] BooleanLiteral
src/modules/org-entitlements/service.ts:261:7
   if (snapshot.access.source === 'compatibility') return null;
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
-  if (!quota) return undefined;
+  if (quota) return undefined;
   return quota.kind === 'numeric' ? quota.limit : null;
 }
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the assigned tariff has no file limit
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ConditionalExpression
src/modules/org-entitlements/service.ts:261:7
   if (snapshot.access.source === 'compatibility') return null;
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
-  if (!quota) return undefined;
+  if (false) return undefined;
   return quota.kind === 'numeric' ? quota.limit : null;
 }
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the assigned tariff has no file limit
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ConditionalExpression
src/modules/org-entitlements/service.ts:262:10
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
   if (!quota) return undefined;
-  return quota.kind === 'numeric' ? quota.limit : null;
+  return false ? quota.limit : null;
 }
 
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/modules/org-entitlements/service.ts:262:10
   if (!snapshot.tariff) return undefined;
   const quota = numericQuotaFromSnapshot(snapshot, 'files');
   if (!quota) return undefined;
-  return quota.kind === 'numeric' ? quota.limit : null;
+  return quota.kind !== 'numeric' ? quota.limit : null;
 }
 
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: Cannot read properties of undefined (reading 'id')

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:273:20
  */
 export function entitlementsFromSnapshot(
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
-): OrgEntitlements {
-  const result = {} as OrgEntitlements;
-  for (const mechanic of MECHANICS) {
-    result[mechanic] = isMechanicIncludedFromSnapshot(snapshot, mechanic);
-  }
-  return result;
-}
+): OrgEntitlements {}
 
 /**

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:275:37
   snapshot: Pick<OrgEntitlementSnapshot, 'tariff' | 'overrides' | 'access'>,
 ): OrgEntitlements {
   const result = {} as OrgEntitlements;
-  for (const mechanic of MECHANICS) {
-    result[mechanic] = isMechanicIncludedFromSnapshot(snapshot, mechanic);
-  }
+  for (const mechanic of MECHANICS) {}
   return result;
 }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:297:94
   );
   return MECHANICS.flatMap((mechanic) => {
     const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-    if (mechanicClass !== 'места' && mechanicClass !== 'запас' && mechanicClass !== 'объём') {
-      return [];
-    }
+    if (mechanicClass !== 'места' && mechanicClass !== 'запас' && mechanicClass !== 'объём') {}
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic
     // tariff quota map, but are enforced with the same snapshot semantics.

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:297:9
   );
   return MECHANICS.flatMap((mechanic) => {
     const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-    if (mechanicClass !== 'места' && mechanicClass !== 'запас' && mechanicClass !== 'объём') {
+    if (false) {
       return [];
     }

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:304:48
     // tariff quota map, but are enforced with the same snapshot semantics.
     const clinicTeamOverride = activeOverrides.get('clinic_team');
     const clinicSeatLimit =
-      clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
+      clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
       mechanic === 'clinic_team'

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:304:7
     // tariff quota map, but are enforced with the same snapshot semantics.
     const clinicTeamOverride = activeOverrides.get('clinic_team');
     const clinicSeatLimit =
-      clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
+      clinicTeamOverride.seatLimitOverride ?? snapshot.tariff?.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
       mechanic === 'clinic_team'

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:306:7
     const clinicSeatLimit =
       clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
-      mechanic === 'clinic_team'
+      true
         ? clinicSeatLimit === null || clinicSeatLimit === undefined
           ? undefined

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:306:7
     const clinicSeatLimit =
       clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
-      mechanic === 'clinic_team'
+      false
         ? clinicSeatLimit === null || clinicSeatLimit === undefined
           ? undefined

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:307:11
       clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
       mechanic === 'clinic_team'
-        ? clinicSeatLimit === null || clinicSeatLimit === undefined
+        ? clinicSeatLimit === null && clinicSeatLimit === undefined
           ? undefined
           : { kind: 'numeric', limit: clinicSeatLimit, unit: 'seats' }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:307:39
       clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats;
     const quota: TariffQuota | { kind: 'numeric'; limit: number; unit: 'seats' } | undefined =
       mechanic === 'clinic_team'
-        ? clinicSeatLimit === null || clinicSeatLimit === undefined
+        ? clinicSeatLimit === null || false
           ? undefined
           : { kind: 'numeric', limit: clinicSeatLimit, unit: 'seats' }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:312:9
           : { kind: 'numeric', limit: clinicSeatLimit, unit: 'seats' }
         : numericQuotaFromSnapshot(snapshot, mechanic);
     const currentUsage = usage[mechanic];
-    if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)
+    if (true)
       return [];
     // Only the mechanics the owner named carry a threshold at all (§5a item 2.6a); everywhere else

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:312:9
           : { kind: 'numeric', limit: clinicSeatLimit, unit: 'seats' }
         : numericQuotaFromSnapshot(snapshot, mechanic);
     const currentUsage = usage[mechanic];
-    if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)
+    if ((!quota || quota.kind !== 'numeric' || quota.limit === null) && currentUsage === undefined)
       return [];
     // Only the mechanics the owner named carry a threshold at all (§5a item 2.6a); everywhere else

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:317:10
     // Only the mechanics the owner named carry a threshold at all (§5a item 2.6a); everywhere else
     // there is no "approaching the limit" step, just below-warning until the limit is reached.
     const warningAtPercent = quotaMechanicSupportsWarning(mechanic)
-      ? ((quota as TariffQuota).warningAtPercent ?? null)
+      ? ((quota as TariffQuota).warningAtPercent && null)
       : null;
     return [

[Survived] ObjectLiteral
src/modules/org-entitlements/service.ts:322:16
     return [
       {
         mechanic,
-        quota: { limit: quota.limit, unit: quota.unit },
+        quota: {},
         usage: currentUsage,
         threshold:

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:325:11
         quota: { limit: quota.limit, unit: quota.unit },
         usage: currentUsage,
         threshold:
-          currentUsage >= quota.limit
+          currentUsage > quota.limit
             ? 'reached'
             : warningAtPercent !== null && currentUsage * 100 >= quota.limit * warningAtPercent

[Survived] ArithmeticOperator
src/modules/org-entitlements/service.ts:327:44
         threshold:
           currentUsage >= quota.limit
             ? 'reached'
-            : warningAtPercent !== null && currentUsage * 100 >= quota.limit * warningAtPercent
+            : warningAtPercent !== null && currentUsage / 100 >= quota.limit * warningAtPercent
               ? 'warning'
               : 'below_warning',

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:327:44
         threshold:
           currentUsage >= quota.limit
             ? 'reached'
-            : warningAtPercent !== null && currentUsage * 100 >= quota.limit * warningAtPercent
+            : warningAtPercent !== null && currentUsage * 100 > quota.limit * warningAtPercent
               ? 'warning'
               : 'below_warning',

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:343:34
 export async function resolveOrgQuotaProjections(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<OrgQuotaProjection[]> {
-  const [snapshot, usage] = await Promise.all([
-    port.getSnapshot(organizationId),
-    port.getEnforcedQuotaUsage(organizationId),
-  ]);
-  return projectQuotas(snapshot, usage);
-}
+): Promise<OrgQuotaProjection[]> {}
 
 /**

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:359:34
 export async function resolveOwnOrgQuotaProjections(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<OrgQuotaProjection[]> {
-  const [snapshot, usage] = await Promise.all([
-    port.getSnapshot(organizationId),
-    port.getOwnQuotaUsage(organizationId),
-  ]);
-  return projectQuotas(snapshot, usage);
-}
+): Promise<OrgQuotaProjection[]> {}
 
 export async function resolveOrgEntitlementSnapshot(

[NoCoverage] ObjectLiteral
src/modules/org-entitlements/service.ts:372:10
   organizationId: string,
 ): Promise<{ entitlements: OrgEntitlements; access: EffectiveOrgCommercialAccess }> {
   const snapshot = await port.getSnapshot(organizationId);
-  return { entitlements: entitlementsFromSnapshot(snapshot), access: snapshot.access };
+  return {};
 }
 

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:379:38
   port: OrgEntitlementsPort,
   organizationId: string,
   mechanic: OrgMechanic,
-): Promise<MechanicAccessResolution> {
-  return port.resolveMechanicAccess(organizationId, mechanic);
-}
+): Promise<MechanicAccessResolution> {}
 
 export async function resolveCabinetAccess(
killedBy: GET /api/patient/courses hides the assigned course list when the clinic disabled courses
statusReason: Cannot read properties of undefined (reading 'state')

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:386:37
 export async function resolveCabinetAccess(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<CabinetAccessResolution> {
-  return port.resolveCabinetAccess(organizationId);
-}
+): Promise<CabinetAccessResolution> {}
 
 /** A numeric file ceiling for the repository write transaction; see `fileStorageLimitFromSnapshot`. */

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:394:39
 export async function resolveFileStorageLimit(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<number | null | undefined> {
-  return fileStorageLimitFromSnapshot(await port.getSnapshot(organizationId));
-}
+): Promise<number | null | undefined> {}
 
 /**
killedBy: tariff and platform mutation gates refuses file metadata creation visibly when the file storage quota is exhausted, without creating the patient folder
statusReason: expected { ok: false, …(1) } to match object { error: 'file_storage_limit_reached' }
(1 matching property omitted from actual)

[NoCoverage] ObjectLiteral
src/modules/org-entitlements/service.ts:412:35
     port.listOverrides(organizationId),
   ]);
 
-  return entitlementsFromSnapshot({
-    tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
-    overrides: overrides.map((override) => ({
-      ...override,
-      quota: override.quota ?? null,
-      expiresAt: override.expiresAt ?? null,
-    })),
-    access: await port.getEffectiveCommercialAccess(organizationId),
-  });
+  return entitlementsFromSnapshot({});
 }
 

[NoCoverage] ObjectLiteral
src/modules/org-entitlements/service.ts:414:45
 
   return entitlementsFromSnapshot({
     tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
-    overrides: overrides.map((override) => ({
-      ...override,
-      quota: override.quota ?? null,
-      expiresAt: override.expiresAt ?? null,
-    })),
+    overrides: overrides.map((override) => ({})),
     access: await port.getEffectiveCommercialAccess(organizationId),
   });

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:439:27
 export async function resolveClinicSeatLimit(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<number | null> {
-  const [tariff, overrides] = await Promise.all([
-    port.getTariffForOrg(organizationId),
-    port.listOverrides(organizationId),
-  ]);
-  const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
-  if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? null;
-}
+): Promise<number | null> {}
 
 export async function resolveEffectiveCommercialAccess(
killedBy: TeamSection seat configuration refusal renders the compatibility organization and names the missing configuration instead of throwing
statusReason: Unable to find an element with the text: Места специалистов не настроены. Укажите их в тарифе или в исключении организации.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="rounded-[var(--doctor-page-bl

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:445:56
     port.listOverrides(organizationId),
   ]);
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
+  const seatOverride = activeOverrides.find((entry) => true);
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? null;

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:445:56
     port.listOverrides(organizationId),
   ]);
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
+  const seatOverride = activeOverrides.find((entry) => false);
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? null;

[Killed] OptionalChaining
src/modules/org-entitlements/service.ts:446:7
   ]);
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
-  if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
+  if (seatOverride.seatLimitOverride != null) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? null;
 }
killedBy: TeamSection seat configuration refusal renders the compatibility organization and names the missing configuration instead of throwing
statusReason: Cannot read properties of undefined (reading 'seatLimitOverride')

[Killed] OptionalChaining
src/modules/org-entitlements/service.ts:447:10
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? null;
+  return tariff.includedSeats ?? null;
 }
 
killedBy: TeamSection seat configuration refusal renders the compatibility organization and names the missing configuration instead of throwing
statusReason: Cannot read properties of null (reading 'includedSeats')

[Killed] LogicalOperator
src/modules/org-entitlements/service.ts:447:10
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? null;
+  return tariff?.includedSeats && null;
 }
 
killedBy: TeamSection seat configuration refusal renders the compatibility organization and names the missing configuration instead of throwing
statusReason: Unable to find an element with the text: Места специалистов не настроены. Укажите их в тарифе или в исключении организации.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <section
      class="rounded-[var(--doctor-page-bl

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:464:47
 
 export class TariffDowngradeBlockedError extends Error {
   readonly blocks: TariffDowngradeBlock[];
-  constructor(blocks: TariffDowngradeBlock[]) {
-    super(`tariff_downgrade_blocked:${blocks.map((block) => block.mechanic).join(',')}`);
-    this.blocks = blocks;
-  }
+  constructor(blocks: TariffDowngradeBlock[]) {}
 }
 

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:465:50
 export class TariffDowngradeBlockedError extends Error {
   readonly blocks: TariffDowngradeBlock[];
   constructor(blocks: TariffDowngradeBlock[]) {
-    super(`tariff_downgrade_blocked:${blocks.map((block) => block.mechanic).join(',')}`);
+    super(`tariff_downgrade_blocked:${blocks.map(() => undefined).join(',')}`);
     this.blocks = blocks;
   }

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:465:82
 export class TariffDowngradeBlockedError extends Error {
   readonly blocks: TariffDowngradeBlock[];
   constructor(blocks: TariffDowngradeBlock[]) {
-    super(`tariff_downgrade_blocked:${blocks.map((block) => block.mechanic).join(',')}`);
+    super(`tariff_downgrade_blocked:${blocks.map((block) => block.mechanic).join("")}`);
     this.blocks = blocks;
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:483:28
   usage: Partial<Record<OrgMechanic, number>>;
   currentTariff: Pick<Tariff, 'mechanics'>;
   targetTariff: Pick<Tariff, 'mechanics' | 'quotas' | 'downgradePolicies'>;
-}): TariffDowngradeBlock[] {
-  const blocks: TariffDowngradeBlock[] = [];
-  for (const mechanic of MECHANICS) {
-    const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-    const policy = params.targetTariff.downgradePolicies[mechanic] ?? 'block';
-    if (mechanicClass === 'запас' || mechanicClass === 'объём') {
-      const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
-        mechanic
-      ];
-      if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
-      const used = params.usage[mechanic] ?? 0;
-      if (used <= targetQuota.limit) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
-    } else if (mechanicClass === 'возможность') {
-      const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
-      const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
-      if (!wasIncluded || willBeIncluded) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
-    }
-  }
-  return blocks;
-}
+}): TariffDowngradeBlock[] {}
 
 /** Dedicated application boundary for platform commercial operations. Routes must capability-gate before use. */

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:485:37
   targetTariff: Pick<Tariff, 'mechanics' | 'quotas' | 'downgradePolicies'>;
 }): TariffDowngradeBlock[] {
   const blocks: TariffDowngradeBlock[] = [];
-  for (const mechanic of MECHANICS) {
-    const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-    const policy = params.targetTariff.downgradePolicies[mechanic] ?? 'block';
-    if (mechanicClass === 'запас' || mechanicClass === 'объём') {
-      const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
-        mechanic
-      ];
-      if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
-      const used = params.usage[mechanic] ?? 0;
-      if (used <= targetQuota.limit) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
-    } else if (mechanicClass === 'возможность') {
-      const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
-      const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
-      if (!wasIncluded || willBeIncluded) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
-    }
-  }
+  for (const mechanic of MECHANICS) {}
   return blocks;
 }

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:487:20
   const blocks: TariffDowngradeBlock[] = [];
   for (const mechanic of MECHANICS) {
     const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
-    const policy = params.targetTariff.downgradePolicies[mechanic] ?? 'block';
+    const policy = params.targetTariff.downgradePolicies[mechanic] && 'block';
     if (mechanicClass === 'запас' || mechanicClass === 'объём') {
       const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:488:65
   for (const mechanic of MECHANICS) {
     const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
     const policy = params.targetTariff.downgradePolicies[mechanic] ?? 'block';
-    if (mechanicClass === 'запас' || mechanicClass === 'объём') {
-      const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
-        mechanic
-      ];
-      if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
-      const used = params.usage[mechanic] ?? 0;
-      if (used <= targetQuota.limit) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
-    } else if (mechanicClass === 'возможность') {
+    if (mechanicClass === 'запас' || mechanicClass === 'объём') {} else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:488:9
   for (const mechanic of MECHANICS) {
     const mechanicClass = MECHANIC_REGISTRY[mechanic].class;
     const policy = params.targetTariff.downgradePolicies[mechanic] ?? 'block';
-    if (mechanicClass === 'запас' || mechanicClass === 'объём') {
+    if (mechanicClass === 'запас' && mechanicClass === 'объём') {
       const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
         mechanic

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:492:27
       const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
         mechanic
       ];
-      if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
+      if (!targetQuota || targetQuota.kind !== 'unlimited' || targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:492:11
       const targetQuota = (params.targetTariff.quotas as Partial<Record<OrgMechanic, TariffQuota>>)[
         mechanic
       ];
-      if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
+      if ((!targetQuota || targetQuota.kind === 'unlimited') && targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:493:20
         mechanic
       ];
       if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
-      const used = params.usage[mechanic] ?? 0;
+      const used = params.usage[mechanic] && 0;
       if (used <= targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:494:11
       ];
       if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
-      if (used <= targetQuota.limit) continue;
+      if (true) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:494:11
       ];
       if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
-      if (used <= targetQuota.limit) continue;
+      if (used < targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:495:11
       if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
+      if (true) blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:495:11
       if (!targetQuota || targetQuota.kind === 'unlimited' || targetQuota.limit === null) continue;
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
+      if (policy !== 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
