[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:143:12
   const activeOverrides = new Map(
     snapshot.overrides
       .filter((override) => isOverrideActive(override.expiresAt))
-      .map((override) => [override.mechanic, override]),
+      .map(() => undefined),
   );
   return MECHANICS.flatMap((mechanic) => {

[NoCoverage] ArrayDeclaration
src/modules/org-entitlements/service.ts:143:26
   const activeOverrides = new Map(
     snapshot.overrides
       .filter((override) => isOverrideActive(override.expiresAt))
-      .map((override) => [override.mechanic, override]),
+      .map((override) => []),
   );
   return MECHANICS.flatMap((mechanic) => {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:146:9
       .map((override) => [override.mechanic, override]),
   );
   return MECHANICS.flatMap((mechanic) => {
-    if (MECHANIC_REGISTRY[mechanic].quotaEnforcement === 'declared_no_enforcement') return [];
+    if (MECHANIC_REGISTRY[mechanic].quotaEnforcement !== 'declared_no_enforcement') return [];
     if (mechanic === 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:146:9
       .map((override) => [override.mechanic, override]),
   );
   return MECHANICS.flatMap((mechanic) => {
-    if (MECHANIC_REGISTRY[mechanic].quotaEnforcement === 'declared_no_enforcement') return [];
+    if (true) return [];
     if (mechanic === 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:147:9
   );
   return MECHANICS.flatMap((mechanic) => {
     if (MECHANIC_REGISTRY[mechanic].quotaEnforcement === 'declared_no_enforcement') return [];
-    if (mechanic === 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
+    if (false) return [];
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic
     // tariff quota map, but are enforced with the same snapshot semantics.

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:147:9
   );
   return MECHANICS.flatMap((mechanic) => {
     if (MECHANIC_REGISTRY[mechanic].quotaEnforcement === 'declared_no_enforcement') return [];
-    if (mechanic === 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
+    if (mechanic !== 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic
     // tariff quota map, but are enforced with the same snapshot semantics.

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:150:52
     if (mechanic === 'clinic_team' && !entitlementsFromSnapshot(snapshot).clinic_team) return [];
     // Specialist seats are configured by includedSeats/seatLimitOverride rather than the generic
     // tariff quota map, but are enforced with the same snapshot semantics.
-    const clinicTeamOverride = activeOverrides.get('clinic_team');
+    const clinicTeamOverride = activeOverrides.get("");
     const quota: TariffQuota | undefined =
       mechanic === 'clinic_team'

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:152:7
     // tariff quota map, but are enforced with the same snapshot semantics.
     const clinicTeamOverride = activeOverrides.get('clinic_team');
     const quota: TariffQuota | undefined =
-      mechanic === 'clinic_team'
+      false
         ? {
             kind: 'numeric' as const,

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:152:7
     // tariff quota map, but are enforced with the same snapshot semantics.
     const clinicTeamOverride = activeOverrides.get('clinic_team');
     const quota: TariffQuota | undefined =
-      mechanic === 'clinic_team'
+      mechanic !== 'clinic_team'
         ? {
             kind: 'numeric' as const,

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:156:15
         ? {
             kind: 'numeric' as const,
             limit:
-              clinicTeamOverride?.seatLimitOverride ??
+              clinicTeamOverride.seatLimitOverride ??
               snapshot.tariff?.includedSeats ??
               CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE,

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:156:15
         ? {
             kind: 'numeric' as const,
             limit:
-              clinicTeamOverride?.seatLimitOverride ??
-              snapshot.tariff?.includedSeats ??
-              CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE,
+              (clinicTeamOverride?.seatLimitOverride ?? snapshot.tariff?.includedSeats) && CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE,
             unit: 'seats',
             period: 'snapshot' as const,

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:157:15
             kind: 'numeric' as const,
             limit:
               clinicTeamOverride?.seatLimitOverride ??
-              snapshot.tariff?.includedSeats ??
+              snapshot.tariff.includedSeats ??
               CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE,
             unit: 'seats',

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:163:12
             period: 'snapshot' as const,
             usagePolicy: 'snapshot' as const,
           }
-        : (activeOverrides.get(mechanic)?.quota ?? snapshot.tariff?.quotas[mechanic]);
+        : (activeOverrides.get(mechanic)?.quota && snapshot.tariff?.quotas[mechanic]);
     const currentUsage = usage[mechanic];
     if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:163:12
             period: 'snapshot' as const,
             usagePolicy: 'snapshot' as const,
           }
-        : (activeOverrides.get(mechanic)?.quota ?? snapshot.tariff?.quotas[mechanic]);
+        : (activeOverrides.get(mechanic).quota ?? snapshot.tariff?.quotas[mechanic]);
     const currentUsage = usage[mechanic];
     if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:165:47
           }
         : (activeOverrides.get(mechanic)?.quota ?? snapshot.tariff?.quotas[mechanic]);
     const currentUsage = usage[mechanic];
-    if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)
+    if (!quota || quota.kind !== 'numeric' || false || currentUsage === undefined)
       return [];
     return [

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:165:19
           }
         : (activeOverrides.get(mechanic)?.quota ?? snapshot.tariff?.quotas[mechanic]);
     const currentUsage = usage[mechanic];
-    if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)
+    if (!quota || false || quota.limit === null || currentUsage === undefined)
       return [];
     return [

[NoCoverage] ArrayDeclaration
src/modules/org-entitlements/service.ts:166:14
         : (activeOverrides.get(mechanic)?.quota ?? snapshot.tariff?.quotas[mechanic]);
     const currentUsage = usage[mechanic];
     if (!quota || quota.kind !== 'numeric' || quota.limit === null || currentUsage === undefined)
-      return [];
+      return ["Stryker was here"];
     return [
       {

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:173:11
         quota,
         usage: currentUsage,
         threshold:
-          currentUsage >= quota.limit
+          currentUsage < quota.limit
             ? 'reached'
             : currentUsage * 5 >= quota.limit * 4

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:173:11
         quota,
         usage: currentUsage,
         threshold:
-          currentUsage >= quota.limit
+          true
             ? 'reached'
             : currentUsage * 5 >= quota.limit * 4

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:175:15
         threshold:
           currentUsage >= quota.limit
             ? 'reached'
-            : currentUsage * 5 >= quota.limit * 4
+            : currentUsage * 5 < quota.limit * 4
               ? 'warning'
               : 'below_warning',

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:175:15
         threshold:
           currentUsage >= quota.limit
             ? 'reached'
-            : currentUsage * 5 >= quota.limit * 4
+            : true
               ? 'warning'
               : 'below_warning',

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:176:17
           currentUsage >= quota.limit
             ? 'reached'
             : currentUsage * 5 >= quota.limit * 4
-              ? 'warning'
+              ? ""
               : 'below_warning',
         enforcement: MECHANIC_REGISTRY[mechanic].quotaEnforcement,

[Survived] StringLiteral
src/modules/org-entitlements/service.ts:177:17
             ? 'reached'
             : currentUsage * 5 >= quota.limit * 4
               ? 'warning'
-              : 'below_warning',
+              : "",
         enforcement: MECHANIC_REGISTRY[mechanic].quotaEnforcement,
       },

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:187:85
 export async function resolveOrgEntitlementSnapshot(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<{ entitlements: OrgEntitlements; access: EffectiveOrgCommercialAccess }> {
-  const snapshot = await port.getSnapshot(organizationId);
-  return { entitlements: entitlementsFromSnapshot(snapshot), access: snapshot.access };
-}
+): Promise<{ entitlements: OrgEntitlements; access: EffectiveOrgCommercialAccess }> {}
 
 /**

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:204:29
 export async function resolveOrgEntitlements(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<OrgEntitlements> {
-  const [tariff, overrides] = await Promise.all([
-    port.getTariffForOrg(organizationId),
-    port.listOverrides(organizationId),
-  ]);
-
-  return entitlementsFromSnapshot({
-    tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
-    overrides: overrides.map((override) => ({
-      ...override,
-      quota: override.quota ?? null,
-      expiresAt: override.expiresAt ?? null,
-    })),
-    access: await port.getEffectiveCommercialAccess(organizationId),
-  });
-}
+): Promise<OrgEntitlements> {}
 
 export async function isMechanicEnabled(

[Survived] ArrayDeclaration
src/modules/org-entitlements/service.ts:205:49
   port: OrgEntitlementsPort,
   organizationId: string,
 ): Promise<OrgEntitlements> {
-  const [tariff, overrides] = await Promise.all([
-    port.getTariffForOrg(organizationId),
-    port.listOverrides(organizationId),
-  ]);
+  const [tariff, overrides] = await Promise.all([]);
 
   return entitlementsFromSnapshot({

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:211:43
   ]);
 
   return entitlementsFromSnapshot({
-    tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
+    tariff: tariff ? { ...tariff, quotas: tariff.quotas && {} } : null,
     overrides: overrides.map((override) => ({
       ...override,

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:212:30
 
   return entitlementsFromSnapshot({
     tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
-    overrides: overrides.map((override) => ({
-      ...override,
-      quota: override.quota ?? null,
-      expiresAt: override.expiresAt ?? null,
-    })),
+    overrides: overrides.map(() => undefined),
     access: await port.getEffectiveCommercialAccess(organizationId),
   });

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:214:14
     tariff: tariff ? { ...tariff, quotas: tariff.quotas ?? {} } : null,
     overrides: overrides.map((override) => ({
       ...override,
-      quota: override.quota ?? null,
+      quota: override.quota && null,
       expiresAt: override.expiresAt ?? null,
     })),

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:215:18
     overrides: overrides.map((override) => ({
       ...override,
       quota: override.quota ?? null,
-      expiresAt: override.expiresAt ?? null,
+      expiresAt: override.expiresAt && null,
     })),
     access: await port.getEffectiveCommercialAccess(organizationId),

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:225:21
   port: OrgEntitlementsPort,
   organizationId: string,
   mechanic: OrgMechanic,
-): Promise<boolean> {
-  const entitlements = await resolveOrgEntitlements(port, organizationId);
-  return entitlements[mechanic];
-}
+): Promise<boolean> {}
 
 /**

[Killed] BlockStatement
src/modules/org-entitlements/service.ts:240:20
 export async function resolveClinicSeatLimit(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<number> {
-  const [tariff, overrides] = await Promise.all([
-    port.getTariffForOrg(organizationId),
-    port.listOverrides(organizationId),
-  ]);
-  const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
-  const overrideByMechanic = new Map(
-    activeOverrides.map((override) => [override.mechanic, override.enabled]),
-  );
-  const clinicTeamEnabled =
-    overrideByMechanic.get('clinic_team') ??
-    tariff?.mechanics.clinic_team ??
-    MECHANIC_DEFAULT_ENABLED.clinic_team;
-  if (!clinicTeamEnabled) return 0;
-
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
-  if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
-}
+): Promise<number> {}
 
 export async function resolveEffectiveCommercialAccess(
killedBy: getSeatStatus counts an active specialist-bound member as a seat, regardless of role
statusReason: expected { limit: undefined, used: 2, …(1) } to deeply equal { limit: 3, used: 2, available: 1 }

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:245:44
     port.getTariffForOrg(organizationId),
     port.listOverrides(organizationId),
   ]);
-  const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
+  const activeOverrides = overrides.filter(() => undefined);
   const overrideByMechanic = new Map(
     activeOverrides.map((override) => [override.mechanic, override.enabled]),

[Survived] MethodExpression
src/modules/org-entitlements/service.ts:245:27
     port.getTariffForOrg(organizationId),
     port.listOverrides(organizationId),
   ]);
-  const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
+  const activeOverrides = overrides;
   const overrideByMechanic = new Map(
     activeOverrides.map((override) => [override.mechanic, override.enabled]),

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:247:25
   ]);
   const activeOverrides = overrides.filter((override) => isOverrideActive(override.expiresAt));
   const overrideByMechanic = new Map(
-    activeOverrides.map((override) => [override.mechanic, override.enabled]),
+    activeOverrides.map(() => undefined),
   );
   const clinicTeamEnabled =

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:250:5
     activeOverrides.map((override) => [override.mechanic, override.enabled]),
   );
   const clinicTeamEnabled =
-    overrideByMechanic.get('clinic_team') ??
-    tariff?.mechanics.clinic_team ??
-    MECHANIC_DEFAULT_ENABLED.clinic_team;
+    (overrideByMechanic.get('clinic_team') ?? tariff?.mechanics.clinic_team) && MECHANIC_DEFAULT_ENABLED.clinic_team;
   if (!clinicTeamEnabled) return 0;
 

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:250:5
     activeOverrides.map((override) => [override.mechanic, override.enabled]),
   );
   const clinicTeamEnabled =
-    overrideByMechanic.get('clinic_team') ??
-    tariff?.mechanics.clinic_team ??
+    overrideByMechanic.get('clinic_team') && tariff?.mechanics.clinic_team ??
     MECHANIC_DEFAULT_ENABLED.clinic_team;
   if (!clinicTeamEnabled) return 0;

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:251:5
   );
   const clinicTeamEnabled =
     overrideByMechanic.get('clinic_team') ??
-    tariff?.mechanics.clinic_team ??
+    tariff.mechanics.clinic_team ??
     MECHANIC_DEFAULT_ENABLED.clinic_team;
   if (!clinicTeamEnabled) return 0;

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:253:7
     overrideByMechanic.get('clinic_team') ??
     tariff?.mechanics.clinic_team ??
     MECHANIC_DEFAULT_ENABLED.clinic_team;
-  if (!clinicTeamEnabled) return 0;
+  if (clinicTeamEnabled) return 0;
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:253:7
     overrideByMechanic.get('clinic_team') ??
     tariff?.mechanics.clinic_team ??
     MECHANIC_DEFAULT_ENABLED.clinic_team;
-  if (!clinicTeamEnabled) return 0;
+  if (false) return 0;
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:255:56
     MECHANIC_DEFAULT_ENABLED.clinic_team;
   if (!clinicTeamEnabled) return 0;
 
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
+  const seatOverride = activeOverrides.find((entry) => true);
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:255:45
     MECHANIC_DEFAULT_ENABLED.clinic_team;
   if (!clinicTeamEnabled) return 0;
 
-  const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
+  const seatOverride = activeOverrides.find(() => undefined);
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:256:7
   if (!clinicTeamEnabled) return 0;
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
-  if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
+  if (false) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
 }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:256:7
   if (!clinicTeamEnabled) return 0;
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
-  if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
+  if (true) return seatOverride.seatLimitOverride;
   return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
 }

[Survived] LogicalOperator
src/modules/org-entitlements/service.ts:257:10
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
+  return tariff?.includedSeats && CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
 }
 

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:257:10
 
   const seatOverride = activeOverrides.find((entry) => entry.mechanic === 'clinic_team');
   if (seatOverride?.seatLimitOverride != null) return seatOverride.seatLimitOverride;
-  return tariff?.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
+  return tariff.includedSeats ?? CLINIC_TEAM_FAIL_CLOSED_SEAT_BASELINE;
 }
 

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:263:42
 export async function resolveEffectiveCommercialAccess(
   port: OrgEntitlementsPort,
   organizationId: string,
-): Promise<EffectiveOrgCommercialAccess> {
-  return port.getEffectiveCommercialAccess(organizationId);
-}
+): Promise<EffectiveOrgCommercialAccess> {}
 
 /** Dedicated application boundary for platform commercial operations. Routes must capability-gate before use. */

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:270:18
 /** Dedicated application boundary for platform commercial operations. Routes must capability-gate before use. */
 export function createPlatformEntitlementsService(port: PlatformEntitlementsPort) {
   return {
-    listTariffs: () => port.listTariffs(),
+    listTariffs: () => undefined,
     listOrganizations: () => port.listOrganizations(),
     getTrialPolicy: () => port.getTrialPolicy(),

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:271:24
 export function createPlatformEntitlementsService(port: PlatformEntitlementsPort) {
   return {
     listTariffs: () => port.listTariffs(),
-    listOrganizations: () => port.listOrganizations(),
+    listOrganizations: () => undefined,
     getTrialPolicy: () => port.getTrialPolicy(),
     createTariff: (

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:272:21
   return {
     listTariffs: () => port.listTariffs(),
     listOrganizations: () => port.listOrganizations(),
-    getTrialPolicy: () => port.getTrialPolicy(),
+    getTrialPolicy: () => undefined,
     createTariff: (
       input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>,

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:276:10
     createTariff: (
       input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>,
       audit: PlatformMutationAudit,
-    ) => {
-      return port.createTariff(normalizeTariffInput(input), audit);
-    },
+    ) => {},
     updateTariff: (
       id: string,

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:283:10
       id: string,
       input: Omit<Tariff, 'id' | 'createdAt' | 'updatedAt'>,
       audit: PlatformMutationAudit,
-    ) => {
-      return port.updateTariff(id, normalizeTariffInput(input), audit);
-    },
+    ) => {},
     archiveTariff: (id: string, audit: PlatformMutationAudit) => {
       return port.archiveTariff(id, audit);

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:286:66
     ) => {
       return port.updateTariff(id, normalizeTariffInput(input), audit);
     },
-    archiveTariff: (id: string, audit: PlatformMutationAudit) => {
-      return port.archiveTariff(id, audit);
-    },
+    archiveTariff: (id: string, audit: PlatformMutationAudit) => {},
     assignTariff: (
       organizationId: string,

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:293:10
       organizationId: string,
       tariffId: string | null,
       audit: PlatformMutationAudit,
-    ) => {
-      return port.assignTariff(organizationId, tariffId, audit);
-    },
+    ) => {},
     upsertOverride: (
       input: {

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:305:10
         expiresAt: string | null;
       },
       audit: PlatformMutationAudit,
-    ) => {
-      assertMechanic(input.mechanic);
-      if (input.quota) assertQuota(input.mechanic, input.quota);
-      if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
-        throw new Error('entitlement_override_expiry_invalid');
-      }
-      return port.upsertOverride(input, audit);
-    },
+    ) => {},
     deleteOverride: (
       organizationId: string,

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:307:11
       audit: PlatformMutationAudit,
     ) => {
       assertMechanic(input.mechanic);
-      if (input.quota) assertQuota(input.mechanic, input.quota);
+      if (true) assertQuota(input.mechanic, input.quota);
       if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
         throw new Error('entitlement_override_expiry_invalid');

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:307:11
       audit: PlatformMutationAudit,
     ) => {
       assertMechanic(input.mechanic);
-      if (input.quota) assertQuota(input.mechanic, input.quota);
+      if (false) assertQuota(input.mechanic, input.quota);
       if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
         throw new Error('entitlement_override_expiry_invalid');

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:308:11
     ) => {
       assertMechanic(input.mechanic);
       if (input.quota) assertQuota(input.mechanic, input.quota);
-      if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
+      if (false) {
         throw new Error('entitlement_override_expiry_invalid');
       }

[NoCoverage] LogicalOperator
src/modules/org-entitlements/service.ts:308:11
     ) => {
       assertMechanic(input.mechanic);
       if (input.quota) assertQuota(input.mechanic, input.quota);
-      if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
+      if (input.expiresAt || !Number.isFinite(new Date(input.expiresAt).getTime())) {
         throw new Error('entitlement_override_expiry_invalid');
       }

[NoCoverage] StringLiteral
src/modules/org-entitlements/service.ts:309:25
       assertMechanic(input.mechanic);
       if (input.quota) assertQuota(input.mechanic, input.quota);
       if (input.expiresAt && !Number.isFinite(new Date(input.expiresAt).getTime())) {
-        throw new Error('entitlement_override_expiry_invalid');
+        throw new Error("");
       }
       return port.upsertOverride(input, audit);

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:317:10
       organizationId: string,
       mechanic: OrgMechanic,
       audit: PlatformMutationAudit,
-    ) => {
-      assertMechanic(mechanic);
-      return port.deleteOverride(organizationId, mechanic, audit);
-    },
+    ) => {},
     setTrialPolicy: (policy: TrialPolicy, audit: PlatformMutationAudit) => {
       assertTrialPolicy(policy);

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:321:76
       assertMechanic(mechanic);
       return port.deleteOverride(organizationId, mechanic, audit);
     },
-    setTrialPolicy: (policy: TrialPolicy, audit: PlatformMutationAudit) => {
-      assertTrialPolicy(policy);
-      return port.setTrialPolicy(policy, audit);
-    },
+    setTrialPolicy: (policy: TrialPolicy, audit: PlatformMutationAudit) => {},
     startTrial: (organizationId: string, audit: PlatformMutationAudit) => {
       return port.startTrial(organizationId, audit);

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:325:75
       assertTrialPolicy(policy);
       return port.setTrialPolicy(policy, audit);
     },
-    startTrial: (organizationId: string, audit: PlatformMutationAudit) => {
-      return port.startTrial(organizationId, audit);
-    },
+    startTrial: (organizationId: string, audit: PlatformMutationAudit) => {},
     extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {
       if (!Number.isSafeInteger(days) || days <= 0) throw new Error('trial_extension_days_invalid');

[NoCoverage] BlockStatement
src/modules/org-entitlements/service.ts:328:90
     startTrial: (organizationId: string, audit: PlatformMutationAudit) => {
       return port.startTrial(organizationId, audit);
     },
-    extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {
-      if (!Number.isSafeInteger(days) || days <= 0) throw new Error('trial_extension_days_invalid');
-      return port.extendTrial(organizationId, days, audit);
-    },
+    extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {},
   };
 }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:329:42
       return port.startTrial(organizationId, audit);
     },
     extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {
-      if (!Number.isSafeInteger(days) || days <= 0) throw new Error('trial_extension_days_invalid');
+      if (!Number.isSafeInteger(days) || false) throw new Error('trial_extension_days_invalid');
       return port.extendTrial(organizationId, days, audit);
     },

[NoCoverage] EqualityOperator
src/modules/org-entitlements/service.ts:329:42
       return port.startTrial(organizationId, audit);
     },
     extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {
-      if (!Number.isSafeInteger(days) || days <= 0) throw new Error('trial_extension_days_invalid');
+      if (!Number.isSafeInteger(days) || days > 0) throw new Error('trial_extension_days_invalid');
       return port.extendTrial(organizationId, days, audit);
     },
