[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:496:16
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
-    } else if (mechanicClass === 'возможность') {
+    } else if (true) {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:496:16
       const used = params.usage[mechanic] ?? 0;
       if (used <= targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
-    } else if (mechanicClass === 'возможность') {
+    } else if (false) {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:497:27
       if (used <= targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
-      const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
+      const wasIncluded = params.currentTariff.mechanics[mechanic] !== true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
       if (!wasIncluded || willBeIncluded) continue;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:497:27
       if (used <= targetQuota.limit) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
-      const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
+      const wasIncluded = false;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
       if (!wasIncluded || willBeIncluded) continue;

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:498:30
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
-      const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
+      const willBeIncluded = true;
       if (!wasIncluded || willBeIncluded) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:498:30
       if (policy === 'block') blocks.push({ mechanic, reason: 'quota_exceeded' });
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
-      const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
+      const willBeIncluded = false;
       if (!wasIncluded || willBeIncluded) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:499:11
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
-      if (!wasIncluded || willBeIncluded) continue;
+      if (true) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
     }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:499:11
     } else if (mechanicClass === 'возможность') {
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
-      if (!wasIncluded || willBeIncluded) continue;
+      if (false) continue;
       if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
     }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:500:11
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
       if (!wasIncluded || willBeIncluded) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
+      if (false) blocks.push({ mechanic, reason: 'mechanic_removed' });
     }
   }

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:500:11
       const wasIncluded = params.currentTariff.mechanics[mechanic] === true;
       const willBeIncluded = params.targetTariff.mechanics[mechanic] === true;
       if (!wasIncluded || willBeIncluded) continue;
-      if (policy === 'block') blocks.push({ mechanic, reason: 'mechanic_removed' });
+      if (true) blocks.push({ mechanic, reason: 'mechanic_removed' });
     }
   }

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:532:10
       organizationId: string,
       tariffId: string | null,
       audit: PlatformMutationAudit,
-    ) => {
-      if (tariffId) {
-        const [organizations, tariffs, usage] = await Promise.all([
-          port.listOrganizations(),
-          port.listTariffs(),
-          port.getOrganizationMechanicUsage(organizationId),
-        ]);
-        const organization = organizations.find((entry) => entry.id === organizationId);
-        const targetTariff = tariffs.find((entry) => entry.id === tariffId);
-        if (!targetTariff) throw new Error('tariff_not_found');
-        const currentTariff = organization?.tariffId
-          ? tariffs.find((entry) => entry.id === organization.tariffId)
-          : null;
-        if (currentTariff) {
-          const blocks = evaluateTariffDowngrade({ usage, currentTariff, targetTariff });
-          if (blocks.length > 0) throw new TariffDowngradeBlockedError(blocks);
-        }
-      }
-      return port.assignTariff(organizationId, tariffId, audit);
-    },
+    ) => {},
     upsertOverride: (
       input: {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:533:11
       tariffId: string | null,
       audit: PlatformMutationAudit,
     ) => {
-      if (tariffId) {
+      if (true) {
         const [organizations, tariffs, usage] = await Promise.all([
           port.listOrganizations(),

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:533:11
       tariffId: string | null,
       audit: PlatformMutationAudit,
     ) => {
-      if (tariffId) {
+      if (false) {
         const [organizations, tariffs, usage] = await Promise.all([
           port.listOrganizations(),

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:539:60
           port.listTariffs(),
           port.getOrganizationMechanicUsage(organizationId),
         ]);
-        const organization = organizations.find((entry) => entry.id === organizationId);
+        const organization = organizations.find((entry) => false);
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:539:49
           port.listTariffs(),
           port.getOrganizationMechanicUsage(organizationId),
         ]);
-        const organization = organizations.find((entry) => entry.id === organizationId);
+        const organization = organizations.find(() => undefined);
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');

[Survived] ArrowFunction
src/modules/org-entitlements/service.ts:540:43
           port.getOrganizationMechanicUsage(organizationId),
         ]);
         const organization = organizations.find((entry) => entry.id === organizationId);
-        const targetTariff = tariffs.find((entry) => entry.id === tariffId);
+        const targetTariff = tariffs.find(() => undefined);
         if (!targetTariff) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:540:54
           port.getOrganizationMechanicUsage(organizationId),
         ]);
         const organization = organizations.find((entry) => entry.id === organizationId);
-        const targetTariff = tariffs.find((entry) => entry.id === tariffId);
+        const targetTariff = tariffs.find((entry) => entry.id !== tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId

[Survived] BooleanLiteral
src/modules/org-entitlements/service.ts:541:13
         ]);
         const organization = organizations.find((entry) => entry.id === organizationId);
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
-        if (!targetTariff) throw new Error('tariff_not_found');
+        if (targetTariff) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId
           ? tariffs.find((entry) => entry.id === organization.tariffId)

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:541:13
         ]);
         const organization = organizations.find((entry) => entry.id === organizationId);
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
-        if (!targetTariff) throw new Error('tariff_not_found');
+        if (true) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId
           ? tariffs.find((entry) => entry.id === organization.tariffId)

[Survived] OptionalChaining
src/modules/org-entitlements/service.ts:542:31
         const organization = organizations.find((entry) => entry.id === organizationId);
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');
-        const currentTariff = organization?.tariffId
+        const currentTariff = organization.tariffId
           ? tariffs.find((entry) => entry.id === organization.tariffId)
           : null;

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:543:37
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId
-          ? tariffs.find((entry) => entry.id === organization.tariffId)
+          ? tariffs.find((entry) => entry.id !== organization.tariffId)
           : null;
         if (currentTariff) {

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:543:37
         const targetTariff = tariffs.find((entry) => entry.id === tariffId);
         if (!targetTariff) throw new Error('tariff_not_found');
         const currentTariff = organization?.tariffId
-          ? tariffs.find((entry) => entry.id === organization.tariffId)
+          ? tariffs.find((entry) => true)
           : null;
         if (currentTariff) {

[Survived] BlockStatement
src/modules/org-entitlements/service.ts:545:28
         const currentTariff = organization?.tariffId
           ? tariffs.find((entry) => entry.id === organization.tariffId)
           : null;
-        if (currentTariff) {
-          const blocks = evaluateTariffDowngrade({ usage, currentTariff, targetTariff });
-          if (blocks.length > 0) throw new TariffDowngradeBlockedError(blocks);
-        }
+        if (currentTariff) {}
       }
       return port.assignTariff(organizationId, tariffId, audit);

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:545:13
         const currentTariff = organization?.tariffId
           ? tariffs.find((entry) => entry.id === organization.tariffId)
           : null;
-        if (currentTariff) {
+        if (true) {
           const blocks = evaluateTariffDowngrade({ usage, currentTariff, targetTariff });
           if (blocks.length > 0) throw new TariffDowngradeBlockedError(blocks);

[Survived] ConditionalExpression
src/modules/org-entitlements/service.ts:547:15
           : null;
         if (currentTariff) {
           const blocks = evaluateTariffDowngrade({ usage, currentTariff, targetTariff });
-          if (blocks.length > 0) throw new TariffDowngradeBlockedError(blocks);
+          if (true) throw new TariffDowngradeBlockedError(blocks);
         }
       }

[Survived] EqualityOperator
src/modules/org-entitlements/service.ts:547:15
           : null;
         if (currentTariff) {
           const blocks = evaluateTariffDowngrade({ usage, currentTariff, targetTariff });
-          if (blocks.length > 0) throw new TariffDowngradeBlockedError(blocks);
+          if (blocks.length >= 0) throw new TariffDowngradeBlockedError(blocks);
         }
       }

[NoCoverage] ConditionalExpression
src/modules/org-entitlements/service.ts:585:11
       return port.startTrial(organizationId, audit);
     },
     extendTrial: (organizationId: string, days: number, audit: PlatformMutationAudit) => {
-      if (!Number.isSafeInteger(days) || days <= 0) throw new Error('trial_extension_days_invalid');
+      if (true) throw new Error('trial_extension_days_invalid');
       return port.extendTrial(organizationId, days, audit);
     },
