[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:32:75
  * Callers supply the concrete action so the UI never has to turn a swallowed 403
  * into an unexplained disabled control.
  */
-export function entitlementMutationRefusalMessage(action: string): string {
-  return `Невозможно ${action}: этот раздел не входит в ваш тариф. Чтобы выполнить действие, включите этот раздел в тарифе клиники.`;
-}
+export function entitlementMutationRefusalMessage(action: string): string {}
 
 export function entitlementMutationRefusalResponse(
killedBy: read-only access state refuses writes across mechanics (§5a 3.1a/3.1b) refuses connecting an external calendar and never reaches the OAuth config
statusReason: expected { ok: false, …(2) } to match object { error: 'entitlement_required', …(2) }
(1 matching property omitted from actual)

[Killed] StringLiteral
src/app-layer/guards/requireEntitlement.ts:33:10
  * into an unexplained disabled control.
  */
 export function entitlementMutationRefusalMessage(action: string): string {
-  return `Невозможно ${action}: этот раздел не входит в ваш тариф. Чтобы выполнить действие, включите этот раздел в тарифе клиники.`;
+  return ``;
 }
 
killedBy: read-only access state refuses writes across mechanics (§5a 3.1a/3.1b) refuses connecting an external calendar and never reaches the OAuth config
statusReason: expected { ok: false, …(3) } to match object { error: 'entitlement_required', …(2) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:39:17
 export function entitlementMutationRefusalResponse(
   mechanic: OrgMechanic,
   action: string,
-): NextResponse {
-  return NextResponse.json(
-    {
-      ok: false,
-      error: 'entitlement_required',
-      mechanic,
-      message: entitlementMutationRefusalMessage(action),
-    },
-    { status: 403 },
-  );
-}
+): NextResponse {}
 
 async function checkEntitlement(
killedBy: read-only access state refuses writes across mechanics (§5a 3.1a/3.1b) refuses connecting an external calendar and never reaches the OAuth config
statusReason: Cannot read properties of undefined (reading 'status')

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:42:11
 ): NextResponse {
   return NextResponse.json(
     {
-      ok: false,
+      ok: true,
       error: 'entitlement_required',
       mechanic,

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:55:81
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
   access: EntitlementAccess,
-): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {
-  const resolution = await resolveMechanicAccess(
-    buildAppDeps().orgEntitlements,
-    ctx.organizationId,
-    mechanic,
-  );
-  if (resolution.state === 'disabled') {
-    return { ok: false, reason: 'entitlement_required' };
-  }
-  if (resolution.state === 'unconfigured') {
-    return { ok: false, reason: 'access_lifecycle_unconfigured' };
-  }
-  if (resolution.state === 'read_only' && access === 'mutation') {
-    return { ok: false, reason: 'commercial_read_only' };
-  }
-  return { ok: true, warning: resolution.warning };
-}
+): Promise<EntitlementSuccess | { ok: false; reason: EntitlementDenialReason }> {}
 
 /**
killedBy: org entitlement mechanic classes allows the patient-card mutation guard when stored tariff and override values are false
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:61:40
     ctx.organizationId,
     mechanic,
   );
-  if (resolution.state === 'disabled') {
-    return { ok: false, reason: 'entitlement_required' };
-  }
+  if (resolution.state === 'disabled') {}
   if (resolution.state === 'unconfigured') {
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
killedBy: GET /api/clinic/members refuses team members when the clinic team is disabled
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:61:7
     ctx.organizationId,
     mechanic,
   );
-  if (resolution.state === 'disabled') {
+  if (false) {
     return { ok: false, reason: 'entitlement_required' };
   }
killedBy: GET /api/patient/courses hides the assigned course list when the clinic disabled courses
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:62:18
     mechanic,
   );
   if (resolution.state === 'disabled') {
-    return { ok: false, reason: 'entitlement_required' };
+    return { ok: true, reason: 'entitlement_required' };
   }
   if (resolution.state === 'unconfigured') {
killedBy: access lifecycle on real clinic and patient surfaces does not render a direct specialist content URL through the shared visibility adapter
statusReason: promise resolved "{ …(10) }" instead of rejecting

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:64:7
   if (resolution.state === 'disabled') {
     return { ok: false, reason: 'entitlement_required' };
   }
-  if (resolution.state === 'unconfigured') {
+  if (true) {
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
   }

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:64:7
   if (resolution.state === 'disabled') {
     return { ok: false, reason: 'entitlement_required' };
   }
-  if (resolution.state === 'unconfigured') {
+  if (false) {
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
   }

[NoCoverage] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:65:18
     return { ok: false, reason: 'entitlement_required' };
   }
   if (resolution.state === 'unconfigured') {
-    return { ok: false, reason: 'access_lifecycle_unconfigured' };
+    return { ok: true, reason: 'access_lifecycle_unconfigured' };
   }
   if (resolution.state === 'read_only' && access === 'mutation') {

[NoCoverage] StringLiteral
src/app-layer/guards/requireEntitlement.ts:65:33
     return { ok: false, reason: 'entitlement_required' };
   }
   if (resolution.state === 'unconfigured') {
-    return { ok: false, reason: 'access_lifecycle_unconfigured' };
+    return { ok: false, reason: "" };
   }
   if (resolution.state === 'read_only' && access === 'mutation') {

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:67:7
   if (resolution.state === 'unconfigured') {
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
   }
-  if (resolution.state === 'read_only' && access === 'mutation') {
+  if (false) {
     return { ok: false, reason: 'commercial_read_only' };
   }

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:67:66
   if (resolution.state === 'unconfigured') {
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
   }
-  if (resolution.state === 'read_only' && access === 'mutation') {
-    return { ok: false, reason: 'commercial_read_only' };
-  }
+  if (resolution.state === 'read_only' && access === 'mutation') {}
   return { ok: true, warning: resolution.warning };
 }

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:68:18
     return { ok: false, reason: 'access_lifecycle_unconfigured' };
   }
   if (resolution.state === 'read_only' && access === 'mutation') {
-    return { ok: false, reason: 'commercial_read_only' };
+    return { ok: true, reason: 'commercial_read_only' };
   }
   return { ok: true, warning: resolution.warning };

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:70:16
   if (resolution.state === 'read_only' && access === 'mutation') {
     return { ok: false, reason: 'commercial_read_only' };
   }
-  return { ok: true, warning: resolution.warning };
+  return { ok: false, warning: resolution.warning };
 }
 

[NoCoverage] BlockStatement
src/app-layer/guards/requireEntitlement.ts:80:21
 export async function assertMechanicEnabled(
   organizationId: string,
   mechanic: OrgMechanic,
-): Promise<boolean> {
-  return (
-    await getMechanicSurfaceVisibility({ organizationId }, mechanic)
-  ).directUrl;
-}
+): Promise<boolean> {}
 
 /** One visibility adapter shared by specialist navigation, patient navigation and direct pages. */

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:96:30
 
 export function resolveMechanicSurfaceVisibility(
   resolution: MechanicAccessResolution,
-): MechanicSurfaceVisibility {
-  const visible =
-    resolution.state === 'full_access' ||
-    resolution.state === 'grace' ||
-    resolution.state === 'read_only';
-  return {
-    specialistNavigation: visible,
-    patientNavigation: visible,
-    directUrl: visible,
-    warning: resolution.warning,
-  };
-}
+): MechanicSurfaceVisibility {}
 
 /**
killedBy: GET /app/patient/content/[slug] — cms_pages mechanic gate acts like a hidden section when the owning clinic disabled cms_pages
statusReason: expected [Function] to throw error including 'NEXT_NOT_FOUND' but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/app-layer/guards/requireEntitlement.ts:98:5
   resolution: MechanicAccessResolution,
 ): MechanicSurfaceVisibility {
   const visible =
-    resolution.state === 'full_access' ||
-    resolution.state === 'grace' ||
-    resolution.state === 'read_only';
+    (resolution.state === 'full_access' || resolution.state === 'grace') && resolution.state === 'read_only';
   return {
     specialistNavigation: visible,
killedBy: GET /app/patient/content/[slug] — cms_pages mechanic gate renders the article when the owning clinic has cms_pages included
statusReason: promise rejected "Error: NEXT_NOT_FOUND" instead of resolving

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:98:5
   resolution: MechanicAccessResolution,
 ): MechanicSurfaceVisibility {
   const visible =
-    resolution.state === 'full_access' ||
-    resolution.state === 'grace' ||
-    resolution.state === 'read_only';
+    true;
   return {
     specialistNavigation: visible,
killedBy: access lifecycle on real clinic and patient surfaces hides the specialist course navigation through the shared visibility adapter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  role="link"
>
  Курсы
</span> instead

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:99:5
 ): MechanicSurfaceVisibility {
   const visible =
     resolution.state === 'full_access' ||
-    resolution.state === 'grace' ||
+    false ||
     resolution.state === 'read_only';
   return {
killedBy: GET /app/patient/go/daily-warmup — warmups mechanic gate redirects to the resolved daily-warmup target when warmups is included
statusReason: expected [Function] to throw error including 'REDIRECT:/app/patient/content/warmup-1' but got 'NEXT_NOT_FOUND'

[Killed] EqualityOperator
src/app-layer/guards/requireEntitlement.ts:99:5
 ): MechanicSurfaceVisibility {
   const visible =
     resolution.state === 'full_access' ||
-    resolution.state === 'grace' ||
+    resolution.state !== 'grace' ||
     resolution.state === 'read_only';
   return {
killedBy: GET /app/patient/go/daily-warmup — warmups mechanic gate acts like a hidden section when the clinic disabled warmups
statusReason: expected [Function] to throw error including 'NEXT_NOT_FOUND' but got 'REDIRECT:undefined'

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:100:5
   const visible =
     resolution.state === 'full_access' ||
     resolution.state === 'grace' ||
-    resolution.state === 'read_only';
+    false;
   return {
     specialistNavigation: visible,
killedBy: doctor navigation schedule access hides courses when disabled and keeps them visible when read-only
statusReason: expected [ 'today', 'patients', …(4) ] to include 'courses'

[Killed] EqualityOperator
src/app-layer/guards/requireEntitlement.ts:100:5
   const visible =
     resolution.state === 'full_access' ||
     resolution.state === 'grace' ||
-    resolution.state === 'read_only';
+    resolution.state !== 'read_only';
   return {
     specialistNavigation: visible,
killedBy: access lifecycle on real clinic and patient surfaces hides the specialist course navigation through the shared visibility adapter
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  role="link"
>
  Курсы
</span> instead

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:122:13
   warning: MechanicAccessWarning,
   variables: Readonly<Record<string, string>>,
   now: Date = new Date(),
-): string[] {
-  // §5a item 7.0 — same rule as the cabinet door: which payment outcome happened is read from the
-  // period that actually lapsed, so «ошибка оплаты» reaches a clinic that did not pay and not one
-  // whose trial simply ran out.
-  const condition = accessNotificationConditionFor(warning.periodSource);
-  if (condition === null) return [];
-  return dueAccessNotifications({
-    notifications: warning.notifications,
-    periodEndsAt: warning.periodEndsAt,
-    now,
-    condition,
-  }).map((rule) => renderAccessNotification(rule.template, variables));
-}
+): string[] {}
 
 export async function getMechanicSurfaceVisibility(
killedBy: access lifecycle on real clinic and patient surfaces renders the owner's due notification texts in the clinic shell, and only those
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Тариф Тариф с лестницей не оплачен. Клиника Клиника.
Received:

[Killed] EqualityOperator
src/app-layer/guards/requireEntitlement.ts:127:7
   // period that actually lapsed, so «ошибка оплаты» reaches a clinic that did not pay and not one
   // whose trial simply ran out.
   const condition = accessNotificationConditionFor(warning.periodSource);
-  if (condition === null) return [];
+  if (condition !== null) return [];
   return dueAccessNotifications({
     notifications: warning.notifications,
killedBy: access lifecycle on real clinic and patient surfaces renders the owner's due notification texts in the clinic shell, and only those
statusReason: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  main:

  Name "":
  <main />

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:127:7
   // period that actually lapsed, so «ошибка оплаты» reaches a clinic that did not pay and not one
   // whose trial simply ran out.
   const condition = accessNotificationConditionFor(warning.periodSource);
-  if (condition === null) return [];
+  if (true) return [];
   return dueAccessNotifications({
     notifications: warning.notifications,
killedBy: access lifecycle on real clinic and patient surfaces renders the owner's due notification texts in the clinic shell, and only those
statusReason: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  main:

  Name "":
  <main />

[Killed] ArrowFunction
src/app-layer/guards/requireEntitlement.ts:133:10
     periodEndsAt: warning.periodEndsAt,
     now,
     condition,
-  }).map((rule) => renderAccessNotification(rule.template, variables));
+  }).map(() => undefined);
 }
 
killedBy: access lifecycle on real clinic and patient surfaces renders the owner's due notification texts in the clinic shell, and only those
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Тариф Тариф с лестницей не оплачен. Клиника Клиника.
Received:

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:139:39
 export async function getMechanicSurfaceVisibility(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<MechanicSurfaceVisibility> {
-  return resolveMechanicSurfaceVisibility(
-    await resolveMechanicAccess(buildAppDeps().orgEntitlements, ctx.organizationId, mechanic),
-  );
-}
+): Promise<MechanicSurfaceVisibility> {}
 
 export async function isMechanicVisible(
killedBy: access lifecycle on real clinic and patient surfaces renders the owner's due notification texts in the clinic shell, and only those
statusReason: Cannot read properties of undefined (reading 'specialistNavigation')

[NoCoverage] BlockStatement
src/app-layer/guards/requireEntitlement.ts:148:21
 export async function isMechanicVisible(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<boolean> {
-  return (await getMechanicSurfaceVisibility(ctx, mechanic)).directUrl;
-}
+): Promise<boolean> {}
 
 /** @deprecated Use the shared surface visibility adapter. */

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:159:72
 export async function requireEntitlementForRead(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
-  const decision = await checkEntitlement(ctx, mechanic, 'read');
-  if (!decision.ok) {
-    return {
-      ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
-    };
-  }
-  return decision;
-}
+): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {}
 
 /** Mutation-only API adapter. Its signature makes lifecycle enforcement non-optional. */
killedBy: GET /api/doctor/courses/[id]/usage refuses course usage when courses are disabled
statusReason: Cannot read properties of undefined (reading 'ok')

[Survived] StringLiteral
src/app-layer/guards/requireEntitlement.ts:160:58
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
-  const decision = await checkEntitlement(ctx, mechanic, 'read');
+  const decision = await checkEntitlement(ctx, mechanic, "");
   if (!decision.ok) {
     return {

[Killed] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:161:7
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
-  if (!decision.ok) {
+  if (decision.ok) {
     return {
       ok: false,
killedBy: GET /api/doctor/courses/[id]/usage refuses course usage when courses are disabled
statusReason: Cannot read properties of undefined (reading 'status')

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:161:21
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
-  if (!decision.ok) {
-    return {
-      ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
-    };
-  }
+  if (!decision.ok) {}
   return decision;
 }

[Survived] ObjectLiteral
src/app-layer/guards/requireEntitlement.ts:162:12
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
   if (!decision.ok) {
-    return {
-      ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
-    };
+    return {};
   }
   return decision;

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:164:41
   if (!decision.ok) {
     return {
       ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
+      response: NextResponse.json({ ok: true, error: decision.reason, mechanic }, { status: 403 }),
     };
   }

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:174:72
 export async function requireEntitlementForMutation(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
-  const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  if (!decision.ok) {
-    return {
-      ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
-    };
-  }
-  return decision;
-}
+): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {}
 
 /** Read-only Server Action adapter. */

[Survived] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:176:7
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  if (!decision.ok) {
+  if (true) {
     return {
       ok: false,

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:176:21
   mechanic: OrgMechanic,
 ): Promise<EntitlementSuccess | { ok: false; response: NextResponse }> {
   const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  if (!decision.ok) {
-    return {
-      ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
-    };
-  }
+  if (!decision.ok) {}
   return decision;
 }

[Survived] ObjectLiteral
src/app-layer/guards/requireEntitlement.ts:179:84
   if (!decision.ok) {
     return {
       ok: false,
-      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, { status: 403 }),
+      response: NextResponse.json({ ok: false, error: decision.reason, mechanic }, {}),
     };
   }

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:191:3
   mechanic: OrgMechanic,
 ): Promise<
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
-> {
-  const decision = await checkEntitlement(ctx, mechanic, 'read');
-  return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
-}
+> {}
 
 /** Mutation-only Server Action adapter. Read adapters cannot silently skip lifecycle enforcement. */
killedBy: loadContentPageForInlineEdit does not load an article for inline editing when CMS is disabled
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Survived] StringLiteral
src/app-layer/guards/requireEntitlement.ts:192:58
 ): Promise<
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
 > {
-  const decision = await checkEntitlement(ctx, mechanic, 'read');
+  const decision = await checkEntitlement(ctx, mechanic, "");
   return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
 }

[Killed] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:193:41
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
 > {
   const decision = await checkEntitlement(ctx, mechanic, 'read');
-  return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
+  return decision.ok ? decision : { ok: true, mechanic, reason: decision.reason };
 }
 
killedBy: loadContentPageForInlineEdit does not load an article for inline editing when CMS is disabled
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "page-1",

[Survived] BlockStatement
src/app-layer/guards/requireEntitlement.ts:202:3
   mechanic: OrgMechanic,
 ): Promise<
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
-> {
-  const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
-}
+> {}
 
 /**

[Survived] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:204:41
   EntitlementSuccess | { ok: false; mechanic: OrgMechanic; reason: EntitlementDenialReason }
 > {
   const decision = await checkEntitlement(ctx, mechanic, 'mutation');
-  return decision.ok ? decision : { ok: false, mechanic, reason: decision.reason };
+  return decision.ok ? decision : { ok: true, mechanic, reason: decision.reason };
 }
 

[Killed] BlockStatement
src/app-layer/guards/requireEntitlement.ts:215:18
 export async function requireEntitlementForPage(
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
-): Promise<void> {
-  if (!(await getMechanicSurfaceVisibility(ctx, mechanic)).directUrl) notFound();
-}
+): Promise<void> {}
 
killedBy: access lifecycle on real clinic and patient surfaces does not render a direct specialist course URL through the shared visibility adapter
statusReason: expected [Function] to throw error including 'NEXT_NOT_FOUND' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/app-layer/guards/requireEntitlement.ts:216:7
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
 ): Promise<void> {
-  if (!(await getMechanicSurfaceVisibility(ctx, mechanic)).directUrl) notFound();
+  if ((await getMechanicSurfaceVisibility(ctx, mechanic)).directUrl) notFound();
 }
 
killedBy: access lifecycle on real clinic and patient surfaces does not render a direct specialist course URL through the shared visibility adapter
statusReason: expected [Function] to throw error including 'NEXT_NOT_FOUND' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/app-layer/guards/requireEntitlement.ts:216:7
   ctx: EntitlementContext,
   mechanic: OrgMechanic,
 ): Promise<void> {
-  if (!(await getMechanicSurfaceVisibility(ctx, mechanic)).directUrl) notFound();
+  if (false) notFound();
 }
 
killedBy: access lifecycle on real clinic and patient surfaces does not render a direct specialist course URL through the shared visibility adapter
statusReason: expected [Function] to throw error including 'NEXT_NOT_FOUND' but got 'Cannot read properties of undefined (…'
